{
    "terms": {
        "А": [
            {
                "term": "ASP",
                "definition": "Application Service Provider — организация - провайдер, предоставляющая услуги по аренде программных продуктов и инфраструктуры на базе периодических платежей."
            },
            {
                "term": "ABAP",
                "definition": "Advanced Business Application Programming — проприетарный внутренний язык программирования высокого уровня, используемый в приложениях корпорации SAP."
            },
            {
                "term": "Абстрактная функция",
                "definition": "Функция без определения, которую переопределяют дочерние классы."
            },
            {
                "term": "Ава",
                "definition": "Графическое обозначение пользователя в Интернете (картинка/фото/изображение)."
            },
            {
                "term": "Авечка",
                "definition": "Звуковая карта Sound Blaster AWE32 на шине ISA, представленная Creative Technology в марте 1994 года."
            },
            {
                "term": "Автогад",
                "definition": "Система автоматизированного проектирования и черчения AutoCAD."
            },
            {
                "term": "Авторизация",
                "definition": "Процесс проверки (подтверждения) прав при попытке выполнения неких действий."
            },
            {
                "term": "Адаптив",
                "definition": "Процесс адаптации веб-страниц или веб-интерфейса к использованию на экранах различных устройств."
            },
            {
                "term": "Аджайл",
                "definition": "Гибкая методология разработки, объединяющая в себе целый ряд подходов и практик, основанных на 12 принципах Манифеста гибкой разработки ПО."
            },
            {
                "term": "Админ",
                "definition": "Специалист, занимающийся настройкой, совершенствованием и поддержкой IT-инфраструктуры."
            },
            {
                "term": "АДСЛ",
                "definition": "Asymmetric Digital Subscriber Line — технология, позволяющая подключаться к интернету через телефонные линии."
            },
            {
                "term": "Айди",
                "definition": "Уникальный признак объекта, который позволяет отличить его от других объектов, то есть идентифицировать."
            },
            {
                "term": "Айпи",
                "definition": "Уникальный адрес компьютера в сети, который присваивается провайдером индивидуально каждому устройству."
            },
            {
                "term": "Айти",
                "definition": "Информационные технологии (IT) — отрасль, связанная с обработкой, передачей и хранением информации."
            },
            {
                "term": "Айти-евангелист",
                "definition": "Человек, который профессионально занимается пропагандой в сфере IT."
            },
            {
                "term": "Айтишник",
                "definition": "Специалист в сфере информационных технологий."
            },
            {
                "term": "Ака",
                "definition": "Фраза 'also known as', означающая 'еще известен как'."
            },
            {
                "term": "Аккаунт",
                "definition": "Учетная запись пользователя, необходимая для аутентификации."
            },
            {
                "term": "Акцесс",
                "definition": "Уровень доступа пользователя или реляционная СУБД Microsoft Access."
            },
            {
                "term": "Алгоритм",
                "definition": "Строго определенный порядок действий для решения задачи."
            },
            {
                "term": "Альфа",
                "definition": "Внутренний этап разработки ПО перед публичным тестированием."
            },
            {
                "term": "Альяс",
                "definition": "Псевдоним, заменяющий длинное и сложное имя."
            },
            {
                "term": "Анлим",
                "definition": "Неограниченный доступ к чему-либо."
            },
            {
                "term": "Аноним",
                "definition": "Человек, скрывающий свою личность в интернете."
            },
            {
                "term": "Анпаблишед",
                "definition": "Неопубликованный или неизданный контент."
            },
            {
                "term": "Анрег",
                "definition": "Незарегистрированный пользователь."
            },
            {
                "term": "Апгрейд",
                "definition": "Усовершенствование или обновление компьютерной техники или ПО."
            },
            {
                "term": "Апдейт",
                "definition": "Обновление программного обеспечения."
            },
            {
                "term": "Апи",
                "definition": "Application Programming Interface — программный интерфейс приложения."
            },
            {
                "term": "Апликуха",
                "definition": "Прикладное программное обеспечение, мобильное приложение."
            },
            {
                "term": "Аплинк",
                "definition": "Вышестоящий линк, с которого узел забирает почту."
            },
            {
                "term": "Апрув",
                "definition": "Подтверждение или одобрение чего-либо."
            },
            {
                "term": "Аркмейл",
                "definition": "Архивированная почта, сжатая архиватором."
            },
            {
                "term": "Архиватор",
                "definition": "Программа для сжатия файлов без потери качества."
            },
            {
                "term": "Ассемблер",
                "definition": "Язык программирования низкого уровня."
            },
            {
                "term": "Аутсорс",
                "definition": "Практика передачи рабочих задач внешним специалистам."
            }
        ],

        "Б": [
            {
                "term": "BCP",
                "definition": "Business Continuity Planning — деятельность, направленная на снижение рисков прерывания бизнеса и восстановление после сбоев."
            },
            {
                "term": "Баг",
                "definition": "Ошибка или дефект в коде программы, вызывающий её некорректную работу."
            },
            {
                "term": "Багоюзер",
                "definition": "Пользователь, который использует ошибки программ в своих интересах."
            },
            {
                "term": "Баг репорт",
                "definition": "Отчет об ошибке, содержащий её описание, причину появления и приоритет."
            },
            {
                "term": "База данных",
                "definition": "Структурированное хранилище данных, предназначенное для их организации и управления."
            },
            {
                "term": "Байт",
                "definition": "Базовая единица хранения информации, состоящая из 8 бит."
            },
            {
                "term": "Бан",
                "definition": "Ограничение или лишение пользователя определенных прав в системе."
            },
            {
                "term": "Бандл",
                "definition": "Маркетинговый приём, включающий объединение товаров или услуг в один пакет."
            },
            {
                "term": "Баннер",
                "definition": "Графическое или анимированное изображение, используемое в рекламе."
            },
            {
                "term": "Батник",
                "definition": "Пакетный файл с последовательностью команд для командного интерпретатора."
            },
            {
                "term": "Бета",
                "definition": "Бета-версия — рабочая версия ПО, находящаяся на стадии публичного тестирования."
            },
            {
                "term": "Библиотека",
                "definition": "Набор скомпилированного кода, предназначенный для повторного использования."
            },
            {
                "term": "Бигдата",
                "definition": "Методы и инструменты для обработки больших объёмов данных."
            },
            {
                "term": "Бит",
                "definition": "Минимальная единица измерения информации, принимающая значения 0 или 1."
            },
            {
                "term": "Биткоин",
                "definition": "Пиринговая платёжная система и одноимённая криптовалюта."
            },
            {
                "term": "Блокчейн",
                "definition": "Методика построения последовательной цепочки блоков с информацией, используемая в криптовалютах."
            },
            {
                "term": "Браузер",
                "definition": "Программное обеспечение для просмотра веб-страниц в Интернете."
            },
            {
                "term": "Бэкап",
                "definition": "Создание резервной копии данных для их восстановления в случае сбоя."
            },
            {
                "term": "Бэкенд",
                "definition": "Серверная часть приложения, отвечающая за обработку данных и логику работы."
            }
            ],

            
        "В": [
            {
                "term": "Вай-Фай",
                "definition": "Wi-Fi — технология беспроводных локальных сетей на основе стандартов IEEE 802.11."
            },
            {
                "term": "Валидатор",
                "definition": "Программное обеспечение или ресурс, проверяющие на правильность код или форму."
            },
            {
                "term": "Валидация",
                "definition": "Проверка систем, процессов, пользователей на соответствие заданным условиям."
            },
            {
                "term": "Валидный",
                "definition": "Допустимый, корректный, соответствующий установленным правилам."
            },
            {
                "term": "Варез",
                "definition": "Интеллектуальная собственность или ПО, распространяемое незаконно."
            },
            {
                "term": "Варезник",
                "definition": "Сайт с открытым доступом к пиратскому ПО, фильмам, книгам и т.д."
            },
            {
                "term": "Варнинг",
                "definition": "Предупреждающее сообщение в интерфейсе, не являющееся ошибкой, но имеющее последствия."
            },
            {
                "term": "Вебинар",
                "definition": "Онлайн-лекция или презентация в режиме реального времени."
            },
            {
                "term": "Видюха",
                "definition": "Видеокарта, устройство для обработки графической информации."
            },
            {
                "term": "Вики",
                "definition": "Общедоступная интернет-энциклопедия, созданная добровольными редакторами."
            },
            {
                "term": "Вилдкарды",
                "definition": "Символы подстановки, используемые для замены других символов."
            },
            {
                "term": "Винда",
                "definition": "Windows — операционная система от Microsoft."
            },
            {
                "term": "Винт",
                "definition": "Жёсткий диск — запоминающее устройство компьютера."
            },
            {
                "term": "Вирус",
                "definition": "Вредоносное ПО, способное встраиваться в код программ и распространяться."
            },
            {
                "term": "Виснуть",
                "definition": "Состояние, при котором компьютер или программа перестаёт отвечать."
            },
            {
                "term": "Витуха",
                "definition": "Витая пара — вид кабеля связи."
            },
            {
                "term": "Войтивайти",
                "definition": "Шуточный термин, обозначающий переход в сферу IT."
            },
            {
                "term": "Ворд",
                "definition": "Microsoft Word — текстовый редактор."
            },
            {
                "term": "Воркшоп",
                "definition": "Обучающее мероприятие с практическими заданиями."
            },
            {
                "term": "Выделенка",
                "definition": "Выделенная линия для интернет-подключения."
            },
            {
                "term": "Выкатить",
                "definition": "Вывести приложение, программу или сайт в открытый доступ."
            },
            {
                "term": "Выпадашка",
                "definition": "Элемент интерфейса в виде выпадающего списка."
            }
        ],
        "Г": [
            {
            "term": "Гаджет",
            "definition": "Небольшой электронный прибор/девайс, который предназначен для того, чтобы помогать человеку в его деятельности"
            },
            {
            "term": "Гайд",
            "definition": "Прописанная инструкция, руководство по достижению определенной цели, правила и порядок действий при выполнении поставленной задачи"
            },
            {
            "term": "Гамать",
            "definition": "Играть"
            },
            {
            "term": "Геймдев",
            "definition": "Процесс разработки игр под определенную платформу"
            },
            {
            "term": "Геймер",
            "definition": "Человек, проводящий время в игре"
            },
            {
            "term": "Геймпад",
            "definition": "Игровой пульт, тип игрового манипулятора. В отличии от джойстика, удерживается одной рукой, а для нажатия используются большие пальцы рук (в современных геймпадах также часто используются указательный и средний пальцы)"
            },
            {
            "term": "Геймплей",
            "definition": "Игровой процесс, сюжет игры, описывающий порядок взаимодействия игрока с игровым миром, то, как он реагирует на действия игрока и как определяется набор действий, который предлагает игроку игра"
            },
            {
            "term": "Гейт",
            "definition": [
                "Сетевой шлюз, устройство/ПО, которое сопрягает разнородные компьютерные сети",
                "Электронное устройство или плагин динамической обработки, предназначенный для контроля уровня звукового сигнала (он пропускает сигнал выше установленного уровня и не пропускает сигнал ниже этого уровня)"
            ]
            },
            {
            "term": "Гектар",
            "definition": "Другое название гигабайта (кратен единице байта) - единица измерения количественной информации, равная 109 (1 000 000 000) или 230 (1 073 741 824) байт"
            },
            {
            "term": "Генерить",
            "definition": "Сгенерировать, создать что-то новое, сформировать что-либо. Часто применяется по отношению к новым идеям и вариантам"
            },
            {
            "term": "Гестуры",
            "definition": "Определенные движения по экрану пальца или стилуса, которые позволяют заменить те или иные команды или их последовательности. Это существенно ускоряет и упрощает работу на мобильных устройствах"
            },
            {
            "term": "Гик",
            "definition": "Индивид, хорошо разбирающийся в каком-либо направлении деятельности и являющийся фанатом своего дела. Сейчас под гиками довольно часто подразумевают айтишников/программистов"
            },
            {
            "term": "Гит",
            "definition": [
                "Система контроля и управления версиями Git, консольная утилита для отслеживания и ведения истории изменения файлов в проекте",
                "Веб-сервис GitHub для хостинга IT-проектов и совместной работы над ними"
            ]
            },
            {
            "term": "Гитхаб",
            "definition": "Крупный веб-сервис для хранения (хостинга) репозиториев IT-проектов и совместной работы над ними. GitHub является своеобразной соц. сетью для программистов, которая позволяет им ознакомится с кодом друг друга, прокомментировать его и помочь в разработке"
            },
            {
            "term": "Гифка",
            "definition": "Растровый графический файл в формате GIF, анимированное цифровое изображение, состоящее из небольшого количества кадров (фреймов), бесконечно сменяющих друг-друга, создавая тем самым некий сюжет/ небольшой мультфильм"
            },
            {
            "term": "Глаз",
            "definition": "Помимо обычного значения, в it-сфере так называют монитор компьютера - устройство, отображающее видео и графическую информацию, которую генерирует видеокарта"
            },
            {
            "term": "Глобальные переменные",
            "definition": "Переменные, объявленные вне блока. Они создаются при запуске программы и уничтожаются после её завершения. Их можно использовать в любом месте файла, после их объявления"
            },
            {
            "term": "Глюк",
            "definition": "Случайная редкая ошибка в программе, вызванная неправильно написанным кодом, либо работой каких-либо сторонних программ"
            },
            {
            "term": "Гмыл",
            "definition": "Имеется ввиду почтовый сервис Gmail от Google или непосредственно сам почтовый ящик на gmail.com"
            },
            {
            "term": "Грызун",
            "definition": "Компьютерная мышь, специальное устройство для управления курсором и передачи определенных команд ПК"
            },
            {
            "term": "Гуглить",
            "definition": "Искать информацию в поисковой строке браузера. Изначально использовалось применительно только к поисковой системе Google, но теперь применяется и к остальным поисковиками"
            },
            {
            "term": "Гуй",
            "definition": "Графический интерфейс пользователя, состоящее из окон, разнообразных меню, кнопок и прочих виджетов"
            },
            {
            "term": "Гуру",
            "definition": "В общем смысле употребляется как синоним слов: учитель, духовный наставник, уважаемый человек, профессионал, опытный мастер. В it-сфере гуру называют крутых программистов"
            }
        ],
        "Д": [
            {
            "term": "Даблклик",
            "definition": "Двойное нажатие"
            },
            {
            "term": "Даблтап",
            "definition": "Двойное короткое нажатие (тап) на выбранный элемент интерфейса сенсорного дисплея, сродни даблклику"
            },
            {
            "term": "Дамп",
            "definition": "Файл, содержащий резервную копию системы/памяти компьютера/базы данных, актуальную на момент его создания. В разработке дампы применяют для создания и поддержания в актуальном состоянии системы бэкапа"
            },
            {
            "term": "Дата центр",
            "definition": "Специализированное здание для размещения и обслуживания серверного, сетевого оборудования"
            },
            {
            "term": "Даунлинк",
            "definition": "Нижестоящий линк, которому данный узел отдаёт почту"
            },
            {
            "term": "Даунлоад",
            "definition": "Процесс передачи (скачивания) файловых данных из одного устройства в другое"
            },
            {
            "term": "Даунлоадер",
            "definition": "Программное обеспечение, предназначенное для загрузки/скачивания файлов"
            },
            {
            "term": "Движок",
            "definition": "Прикладная часть программного кода (программа/часть программы/комплекс программ/библиотека), выделенная для реализации определенной задачи"
            },
            {
            "term": "Двухголовый",
            "definition": "В it имеется ввиду компьютер с двумя мониторами, либо двухъядерный процессор"
            },
            {
            "term": "Дебажить",
            "definition": "Производить поиск ошибок/багов в программе с последующим их исправлением"
            },
            {
            "term": "Девайс",
            "definition": "Любое полезное техническое устройство/приспособление, конструктивно законченная техническая система, имеющая определённое функциональное назначение (ноутбук/смартфон/планшет/умные часы и т.д.)"
            },
            {
            "term": "Девелопер",
            "definition": "Специалист, который непосредственно занимается разработкой ПО и приложений"
            },
            {
            "term": "Девелопмент",
            "definition": "Разработка чего-либо: сайтов, программного обеспечения, приложений, игр и т.д."
            },
            {
            "term": "Дед",
            "definition": "Русифицированное произношение GoldED и GoldED+: популярного редактора сообщений для Фидонет и совместимых сетей"
            },
            {
            "term": "Дедикейтед",
            "definition": "Хостинг с предоставлением клиенту реально существующей машины (в отличии от виртуального хостинга)"
            },
            {
            "term": "Дедлайн",
            "definition": "Крайний итоговый срок, к которому должна быть выполнена та или иная задача/сдан проект/достигнута цель"
            },
            {
            "term": "Декремент",
            "definition": "Уменьшение значения переменной на заданное значение (обычно, на единицу)"
            },
            {
            "term": "Делфи",
            "definition": "Императивный, структурированный, объектно-ориентированный, высокоуровневый язык программирования со строгой статической типизацией переменных. В основном, используется для написание прикладного ПО"
            },
            {
            "term": "Демка",
            "definition": "Демонстрационная версия чего-либо (приложения, подписки, ПО), зачастую, с ограниченным функционалом или с коротким пробным периодом пользования"
            },
            {
            "term": "Деплой",
            "definition": "Развёртывание (перенос/помещение) программного обеспечения (исполняемого кода) на выбранный сервер или конкретное устройство, где оно будет работать"
            },
            {
            "term": "Десктоп",
            "definition": [
                "Тип корпуса системного блока компьютера, настольный компьютер, предназначенный для постоянного размещения на столе",
                "Рабочий стол - вся площадь экрана при работе в операционной системе"
            ]
            },
            {
            "term": "Деструктор",
            "definition": "Специальный тип метода класса, который выполняется при удалении объекта класса. Деструкторы созданы для деинициализации объекта (очистки памяти) после инициализации класса с помощью конструкторов"
            },
            {
            "term": "Дефолтный",
            "definition": "Значения, которые присваиваются параметрам автоматически («по умолчанию») в тех случаях, когда юзер не задал им ни одно из допустимых значений"
            },
            {
            "term": "Джаббер",
            "definition": "Открытый протокол для быстрого обмена сообщениями ХМРР, а также собирательное название работающих с его использованием клиентских программ"
            },
            {
            "term": "Джава",
            "definition": "Язык программирования, который используется для написания приложений, работающих в под управлением веб-браузера, а также для мобильных устройств"
            },
            {
            "term": "Джаваскрипт",
            "definition": "Мультипарадигменный язык программирования, который поддерживает объектно-ориентированный, императивный и функциональный стили"
            },
            {
            "term": "Джампер",
            "definition": "Небольшой переключатель на материнской плате и других картах, на аппаратном уровне фиксирующий какой-либо параметр"
            },
            {
            "term": "Джуниор",
            "definition": "Общепринятое в it название младшего разработчика (начальный уровень программиста), специалиста без опыта или с минимальным опытом работы"
            },
            {
            "term": "Диалап",
            "definition": "Коммутированное удаленное соединение, подключение к провайдеру, используя модем и телефонную сеть общего пользования"
            },
            {
            "term": "Дидос",
            "definition": "Массированная атака на сетевые ресурсы или каналы связи с помощью заражённых «третьих» компьютеров-зомби с целью сделать их недоступными для легитимных пользователей"
            },
            {
            "term": "Динамическая библиотека",
            "definition": "Фактически исполняемый файл. Состоит из подпрограмм, которые подгружаются в вашу программу во время её выполнения"
            },
            {
            "term": "Динамический массив",
            "definition": "Массив, который способен изменять свой размер во время выполнения программы и дает возможность более гибкой работы с данными"
            },
            {
            "term": "Директ",
            "definition": [
                "Яндекс.Директ - сервис для продвижения товаров и услуг с помощью контекстной рекламы в поисковой системе Яндекса и у его партнеров",
                "Отправка данных напрямую, в обход роутинга",
                "Мессенджер внутри приложения Instagram, позволяющий пользователям обмениваться сообщениями"
            ]
            },
            {
            "term": "Директория",
            "definition": "Синоним слова «каталог», папка с какими-либо файлами на ПК"
            },
            {
            "term": "Диск",
            "definition": [
                "Любой смонтированный в системе носитель информации, имеющий в названии «букву»",
                "CD или DVD диск (оптический носитель информации, на котором процесс записи и считывания информации осуществляется с помощью лазера)"
            ]
            },
            {
            "term": "Дисконнект",
            "definition": "Временное отключение/разрыв/потеря связи или соединения"
            },
            {
            "term": "Дистр",
            "definition": "Форма распространения программного обеспечения, установочный комплект файлов/ПО"
            },
            {
            "term": "Дистрибутив",
            "definition": "Форма распространения ПО, обычно дистрибутив содержит программу установщик с выбором режимов и параметров установки"
            },
            {
            "term": "Домен",
            "definition": [
                "Уникальный онлайн адрес/имя сайта, место его размещения в Интернете",
                "Часть фидонетовского адреса, которая содержит название глобальной сети"
            ]
            },
            {
            "term": "ДоС",
            "definition": "Отказ сервера в обслуживании, невозможность обработки информации из-за множества поступающих запросов"
            },
            {
            "term": "Драй",
            "definition": "В программировании принцип разработки ПО, предлагающий избегать повторений различной информации в коде"
            },
            {
            "term": "Драйвер",
            "definition": "Компьютерное ПО, с помощью которого другое ПО/ОС взаимодействует с аппаратным обеспечением"
            },
            {
            "term": "Дропбокс",
            "definition": "Файловый хостинг, позволяющий размещать файлы на удалённых серверах"
            },
            {
            "term": "Дроплист",
            "definition": "Элемент графического интерфейса пользователя (выпадающий / раскрывающийся список), дающий возможность юзеру выбрать одно из нескольких существующих значений параметра"
            },
            {
            "term": "Дропнуть",
            "definition": "В IT подразумевается обычно удаление чего-либо"
            },
            {
            "term": "Дыра",
            "definition": "Уязвимое место, возможность получить незаконный доступ к чему-либо"
            }
        ],
        "Е": [
            {
            "term": "Ебизнес",
            "definition": "Бизнес-модель, в которой бизнес-процессы, обмен информацией и коммерческие транзакции осуществляются с помощью информационных систем"
            },
            {
            "term": "Еггогология",
            "definition": "Изучение и использование скрытых, недокументированных возможностей микрокалькуляторов"
            },
            {
            "term": "Египетские скобки",
            "definition": "Стиль оформления кода в C-подобных языках, когда открывающие/закрывающие скобки ставятся в конце текущего ряда, это позволяет писать код более компактно"
            },
            {
            "term": "Еррор",
            "definition": "Ошибка, образуется при выполнении недопустимых условий или операций"
            }
        ],
        "Ж": [
            {
            "term": "Железо",
            "definition": "Материально-техническая часть/комплектующие компьютеров/ноутбуков/смартфонов и т.д."
            },
            {
            "term": "Железячник",
            "definition": "Человек, на постоянной основе интересующийся/следящий за появлением нового 'железа' (т.е. комплектующих компьютерной техники), хорошо разбирающийся в нём"
            },
            {
            "term": "ЖЖ",
            "definition": "Живой журнал, онлайн-дневник, который располагается на блог-платформе Livejournal.com"
            },
            {
            "term": "Жипег",
            "definition": "Растровый графический формат файлов JPEG (JPG), использующийся для хранения фотографий и других графических изображений"
            },
            {
            "term": "Жмыл",
            "definition": "Популярный бесплатный почтовый сервис Gmail от Google, предоставляющий доступ к электронным почтовым ящикам"
            },
            {
            "term": "Жужунчик",
            "definition": "Флоппи-привод, дисковод, который предназначен для считывания и записи информации с дискет 3.5 дюйма"
            }
        ],
        "З": [
            {
            "term": "Зааджастить",
            "definition": "Немного поменять логику программы, внести легкие изменения, до настроить, привести в порядок, отрегулировать"
            },
            {
            "term": "Заасайнить таск",
            "definition": "Значит 'поручить задание'. Обычно, используется в контексте распределения рабочих задач между специалистами в программе-менеджере"
            },
            {
            "term": "Забанить",
            "definition": "Запретить доступ к выбранному ресурсу, лишить возможности пользователя отправлять сообщения на форуме или в чате"
            },
            {
            "term": "Забэкапить",
            "definition": "Сделать резервную копию чего-либо для последующего восстановления данных"
            },
            {
            "term": "Зависание",
            "definition": "Нерегламентированное состояние, при котором одна или несколько программ или вся ОС полностью не реагируют на команды юзера"
            },
            {
            "term": "Заголовочные файлы",
            "definition": "В программировании обозначает файл, механически 'вставляемый' компилятором в исходный текст, в том месте, где располагается некоторая директива"
            },
            {
            "term": "Задрот",
            "definition": "1) Прозвище человека, слишком много времени уделяющего виртуальному миру (компьютерные игры, программирование и т.д.); 2) Ярый фанатик своего дела, который сильно зациклен на нем, зачастую не очень приспособлен к реальной жизни"
            },
            {
            "term": "Зазиповать",
            "definition": "Перевести готовый архив с какими-то файлами в формат .zip"
            },
            {
            "term": "Законнектиться",
            "definition": "Присоединиться к чему-либо, установить связь, наладить контакт"
            },
            {
            "term": "Залить",
            "definition": "Загрузить файлы на сервер/сайт или закачать информацию в базу данных/файлообменник"
            },
            {
            "term": "Залогиниться",
            "definition": "Войти в систему/программу в качестве зарегистрированного пользователя, с использованием определённого логина и пароля"
            },
            {
            "term": "Залочить",
            "definition": "Установить блокировку на персональное устройство (ПК, смартфон, планшет) для защиты от несанкционированного доступа сторонних лиц"
            },
            {
            "term": "Запилить",
            "definition": "Создать/сделать/выложить что-либо, добавить какую-то функциональность"
            },
            {
            "term": "Заплатка",
            "definition": "Дополнение или обновление, призванное исправить существующие ошибки/баги/глюки в системе или ПО. Процесс применения патча (заплатки) к программе называется пропатчиванием"
            },
            {
            "term": "Запостить",
            "definition": "1) Создать и выложить пост в социальной сети/блоге; 2) В сети Фидонет - посылать сообщения в эху"
            },
            {
            "term": "Зарарить",
            "definition": "Перевести готовый архив с какими-то файлами в формат .rar"
            },
            {
            "term": "Зарегать",
            "definition": "Произвести регистрацию чего-либо: учетной записи, программы, никнейма, канала, блога"
            },
            {
            "term": "Зарелизить",
            "definition": "Официально выпустить новую версию продукта, доступную для использования"
            },
            {
            "term": "Засейвить",
            "definition": "Сохранить некую информацию/версию"
            },
            {
            "term": "Засерить",
            "definition": "Сделать выбранный элемент разрабатываемого интерфейса неактивным (обычно обозначается серым цветом)"
            },
            {
            "term": "Зафакапить",
            "definition": "Полностью провалить поставленную задачу, целиком испортить задание"
            },
            {
            "term": "Зафейлить",
            "definition": "Небольшой прокол, например, не уложиться в заявленное время, выполняя задачу"
            },
            {
            "term": "Звуковуха",
            "definition": "Звуковая плата, позволяющая работать со звуками на ПК"
            },
            {
            "term": "Зловред",
            "definition": "Вредоносное ПО, обычно вирус или шпионская программа"
            },
            {
            "term": "Змея",
            "definition": "Универсальный высокоуровневый скриптовый язык программирования, имеющий минималистичный синтаксис и направленный на повышение читаемости кода и увеличение производительности разработчика"
            },
            {
            "term": "Зомби",
            "definition": "В IT сфере так называют компьютеры, содержащие троянские программы"
            },
            {
            "term": "ЗЫ",
            "definition": "То же, что латинское 'PS' в кириллической раскладке. Означает постскриптум, т.е. дополнение к уже сказанному/написанному"
            }
        ],
        "И": [
            {
            "term": "Ибешник",
            "definition": "Специалист отдела информационной безопасности, занимающийся обеспечением конфиденциальности и сохранности данных компании и отдельных пользователей"
            },
            {
            "term": "Игнор",
            "definition": "1) метка, которой один участник чата отмечает другого участника, при этом система игнорирует сообщения выбранного пользователя; 2) Простое игнорирование чьих-либо сообщений (не открывать/не читать/не отвечать)"
            },
            {
            "term": "Идентификатор",
            "definition": "В языках программирования обозначает имя переменной/функции/класса или некого другого объекта"
            },
            {
            "term": "Иконка",
            "definition": "Элемент графического интерфейса, маленькая картинка, которая обозначает приложение/файл/каталог/устройство и т. п."
            },
            {
            "term": "ИК порт",
            "definition": "Устройство, которое позволяет установить беспроводное соединение с любым устройством, тоже имеющим ИК-порт и находящимся в прямой видимости от аппарата"
            },
            {
            "term": "Икспи",
            "definition": "Windows XP, операционная система семейства Windows NT корпорации Microsoft"
            },
            {
            "term": "Иксы",
            "definition": "Так в разговорном языке называют стандарт X Window System, на котором, аналогично окошкам в ОС Windows, основана графическая оболочка в Linux-дистрибутивах"
            },
            {
            "term": "Имба",
            "definition": "Несбалансированный элемент, персонаж или предмет в компьютерной игре. Обычно термин применяется в онлайн-играх по отношению к более сильному на фоне остальных игроку/персонажу"
            },
            {
            "term": "Имплементация",
            "definition": "В объектно-ориентированном программировании термин обозначает практическую реализацию методов"
            },
            {
            "term": "Имплементить",
            "definition": "Реализовывать, исполнить намеченное"
            },
            {
            "term": "Имхо",
            "definition": "По моему скромному мнению. В русифицированной версии расшифровывается как: 'Имею Мнение Хрен Оспоришь'"
            },
            {
            "term": "Индусский код",
            "definition": "Код, который написан слишком длинно и 'кудряво'. Такое название связано с особенностями оплаты работы программистов в Индии: им платят за каждую строчку кода. Хитрые специалисты прописывают лишние бесполезные строки"
            },
            {
            "term": "Инкапсуляция",
            "definition": "1) Упаковка данных и/или функций в единый компонент; 2) Процесс скрытого хранения деталей реализации объекта от пользователей/программистов и предоставление им для работы интерфейсов классов"
            },
            {
            "term": "Инкремент",
            "definition": "Уменьшение значения переменной на заданное значение (обычно, на единицу)"
            },
            {
            "term": "Инсталлировать",
            "definition": "Устанавливать некую программу/систему на ПК"
            },
            {
            "term": "Интегрированная среда разработки",
            "definition": "Комплекс ПО, содержащего необходимые элементы для разработки, компиляции, линкинга и отладки кода"
            },
            {
            "term": "Интерактив",
            "definition": "Двухсторонняя связь с сервером"
            },
            {
            "term": "Интерпретатор",
            "definition": "ПО, напрямую выполняющее написанный код, перед этим не проводя его компиляцию (т.е. не переводя его в машинный код)"
            },
            {
            "term": "Интранет",
            "definition": "Сеть внутри организации, которая использует протокол TCP/IP; может быть подключена к Интернету или существовать автономно и полностью изолированно"
            },
            {
            "term": "Информационная Безопасность",
            "definition": "Практика сохранения и защиты информации от несанкционированного доступа, использования, раскрытия, искажения и редактирования"
            },
            {
            "term": "ИП",
            "definition": "1) Протокол, обеспечивающий доставку пакетов, снабженных IP адресом; 2) Группа из четырёх десятичных чисел, являющаяся уникальным адресом ПК или сайта в Сети"
            },
            {
            "term": "ИП динамический",
            "definition": "Временный адрес, который выдается компьютеру при присоединении к провайдеру только на время текущей сессии"
            },
            {
            "term": "ИП статический",
            "definition": "Постоянный адрес, который закреплен провайдером за конкретным ПК/сайтом"
            },
            {
            "term": "Ирка",
            "definition": "Чат в системе IRC (Internet Relay Chat): протокол прикладного уровня, предназначенный для обмена сообщениями в режиме on-line. Обычно используется для группового общения, а также общения в личных сообщениях и обмена данными, в т.ч. файлами"
            },
            {
            "term": "Искалка",
            "definition": "Компьютерная поисковая система, необходимая для удобного поиска необходимой информации (внутри устройства или в Сети)"
            },
            {
            "term": "Исходник",
            "definition": "1) Файлы с исходным кодом приложения, или сам исходный код; 2) Первоначальный исходный материал (текст), на основе которого создается что-то новое"
            },
            {
            "term": "Итератор",
            "definition": "Интерфейс, предназначенный специально для перебора элементов контейнера (например, значений массива/символов в строке), обеспечивающий доступ к каждому из них во время перемещения (итеррирования) по элементам"
            },
            {
            "term": "Итерация",
            "definition": "Повторение определенного действия/шага/этапа"
            }
        ],
        "К": [
            {
            "term": "Казнет",
            "definition": "Совокупность информационных технологий и инфраструктуры, обеспечивающих доступ к сети интернет, а также хостинг электронных ресурсов на территории Казахстана с присвоенным доменом первого уровня .kz"
            },
            {
            "term": "Камень",
            "definition": "Центральный процессор, основная составная часть каждого компьютера, выполняет в системе роль своеобразной мини атс"
            },
            {
            "term": "Капс",
            "definition": "Стиль регистра с заглавными буквами (верхний регистр). Термин пошел от названия кнопки «CapsLock», которая позволяет писать в верхнем регистре без нажатия клавиши «Shift»"
            },
            {
            "term": "Капсить",
            "definition": "Писать сообщения капсом (заглавными буквами), часто воспринимается как грубость - кричать/повышать голос. Крайне не приветствуется на форумах и в чатах без особой нужды"
            },
            {
            "term": "Капча",
            "definition": "Картинка, предназначенная для проверки пользователя на предмет его реальности (не является ли он ботом). Капча используется с целью защиты от авто-регистраций и спам-ботов"
            },
            {
            "term": "Карбонка",
            "definition": "Неформальное название специальной области, куда копируются личные письма из эхоконференций"
            },
            {
            "term": "Касперыч",
            "definition": "Антивирус Касперского (ПО, предоставляющее юзерам защиту от всевозможных компьютерных вирусов, троянов, шпионских программ, руткитов с помощью проактивной защиты, включающей компонент HIPS)"
            },
            {
            "term": "Кастомер",
            "definition": "Покупатель, клиент или заказчик компании, который приобретает товары/услуги"
            },
            {
            "term": "Каталог",
            "definition": "Объект в файловой системе, который упрощает хранение и упорядочивание файлов"
            },
            {
            "term": "Катюша",
            "definition": "Процессор AMD K6, разработанный компанией AMD в 1997 году"
            },
            {
            "term": "Качалка",
            "definition": "Менеджер загрузок, программа, которая обеспечивает возможность загрузки выбранных файлов из Интернета или локальной сети"
            },
            {
            "term": "КБПС",
            "definition": "Обозначение скорости сетевого соединения или битрейта мультимедийного файла, равное килобиту в секунду"
            },
            {
            "term": "Квотинг",
            "definition": "Цитата, цитирование комментария/высказывания при интернет-общении. Иногда квотингом называют излишнее употребление цитат"
            },
            {
            "term": "Кейс",
            "definition": "Реальная ситуация/случай из практики, произошедшие с человеком. Сейчас обычно используется применительно к опыту и конкретным наработкам специалиста, подтвержденным цифрами и наглядными примерами"
            },
            {
            "term": "Киберсквоттинг",
            "definition": "Приобретение или перехват на аукционе привлекательных/звучных доменных имен (регистрация) для их последующей выгодной перепродажи"
            },
            {
            "term": "Кибибайт",
            "definition": "Единица, созданная в 1998 году для измерения количества информации. Равна 210 (1024) байт"
            },
            {
            "term": "Кило",
            "definition": "Килобайт, единица измерения количества информации, равная 1024 байтам (иногда 1000 байтам)"
            },
            {
            "term": "Килобакс",
            "definition": "Единица счета денег, равная 1000 или 1024 долларам США. Принято использовать при расчете зарплат класса белых воротничков в Америки"
            },
            {
            "term": "Кирпич",
            "definition": "Неработающее мобильное устройство (например, смартфон). Есть связанное понятие - \"окирпичивание\": это ситуация, когда кто-то сломал/сделал неработоспособным устройство"
            },
            {
            "term": "Клава",
            "definition": "Клавиатура: устройство с комплектом клавиш, предназначенное для ввода/вывода данных и управления гаджетом, к которому оно подключено"
            },
            {
            "term": "Кладж",
            "definition": "Управляющие строки, которые содержат техническую информацию о письме, скрытую по умолчанию при просмотре в редакторе"
            },
            {
            "term": "Клик",
            "definition": "Щелчок - характерный звук нажатия клавиши на клавиатуре механического типа; одиночное разовое нажатие кнопки мыши; событие, которое возникает при нажатии кнопки мыши; переход на сайт при нажатии на выбранную ссылку"
            },
            {
            "term": "Клон",
            "definition": "Точная копия электронного устройства от популярного бренда, произведенная малоизвестным производителем; копия сайта/платформы в Сети Интернет, созданная обычно для мошеннических действий"
            },
            {
            "term": "Кнопка",
            "definition": "Элемент интерфейса программы/сайта/приложения, созданный по аналогии с кнопками в технике (изображается в схожей стилистике и выполняет аналогичные функции); любая клавиша на клавиатуре"
            },
            {
            "term": "Ковёр",
            "definition": "В компьютерной сфере так называют коврик для мыши"
            },
            {
            "term": "Коворкинг",
            "definition": "Современное арендованное помещение открытого типа, предназначенное для удобной и комфортной работы специалистов различных сфер деятельности, фрилансеров"
            },
            {
            "term": "Код",
            "definition": "Последовательность определенных команд (слов/символов) на каком-либо языке программирования; ПО (исходный HTML код) сайта"
            },
            {
            "term": "Кодер",
            "definition": "Программисты, которые занимаются непосредственно написанием программного кода"
            },
            {
            "term": "Кодить",
            "definition": "Заниматься программированием, т.е. реализацией задуманного алгоритма в виде кода разрабатываемого продукта"
            },
            {
            "term": "Код-ревью",
            "definition": "Аудит/проверка разработанного кода с целью нахождения и исправления ошибок, незамеченных при его написании"
            },
            {
            "term": "Колокейшн",
            "definition": "Услуга по размещению собственного физического сервера на чужой точке (специальная площадка в дата-центр)"
            },
            {
            "term": "Комбобокс",
            "definition": "Поле с комбинированным списком – элемент графического интерфейса юзера, сочетающий в себе выпадающий список и однострочное текстовое поле для ввода значения вручную"
            },
            {
            "term": "Коммит",
            "definition": "Запись индексированных изменений в хранилище (репозиторий), содержащая данные об изменениях, комментарий и имя автора"
            },
            {
            "term": "Коммитить",
            "definition": "Проводить сохранение/фиксацию произведенных изменений кода в хранилище кода (репозиторий)"
            },
            {
            "term": "Коммуняка",
            "definition": "Коммуникатор (прародитель современного смартфона), представляющий собой гибрид телефона и карманного компьютера"
            },
            {
            "term": "Компилить",
            "definition": "Осуществлять компиляцию, т.е. перевод написанного кода с языка программирования на машинный язык"
            },
            {
            "term": "Компилятор",
            "definition": "Программа, выполняющая компиляцию (перевод написанного кода с языка программирования на машинный язык)"
            },
            {
            "term": "Компиляция",
            "definition": "Конвертация (перевод) кода, который был написан на высокоуровневом языке программирования, в исполняемую программу, позволяющую машине понять его напрямую"
            },
            {
            "term": "Комплейн",
            "definition": "Выражение недовольства/официальная жалоба координатору проекта"
            },
            {
            "term": "Комьюнити",
            "definition": "Ограниченное сообщество/группа людей, которые являются пользователями одного и того же сетевого ресурса/сообщества/приложения; группа разработчиков и других специалистов, работающих над одним проектом или несколькими продуктами одной компании"
            },
            {
            "term": "Коннект",
            "definition": "Установленная связь между объектами. В IT это обеспечение связи между удаленными компьютерами"
            },
            {
            "term": "Константа",
            "definition": "Переменная, значение которой не поддается изменению"
            },
            {
            "term": "Контент",
            "definition": "Содержательное наполнение сайта/соц.сети/блога (текстовки, изображения, аудио и видео файлы), поддающееся простому редактированию через админ-панель"
            },
            {
            "term": "Конфа",
            "definition": "Сокращенное название конференции: общение между группой людей (реальное собрание или удаленное по средствам интернет-соединения)"
            },
            {
            "term": "Конфиг",
            "definition": "Текстовый конфигурационный файл, который используется для хранения директивы настроек системы/команды загрузки драйверов"
            },
            {
            "term": "Копипаст",
            "definition": "Команды \"скопировать\" и \"вставить\". Иногда иронично называют псевдо-творческую деятельность, сводящуюся лишь к копированию уже существующей информации"
            },
            {
            "term": "Кора дуба",
            "definition": "64-разрядный микропроцессор Intel Core 2 Duo, основанный на микроархитектуре Core, созданный для клиентских систем"
            },
            {
            "term": "Корень",
            "definition": "1) Корневая директория на диске: папка/каталог, являющаяся вышестоящей для всех файлов и подпапок на устройстве; 2) Root - аккаунт сисадмина в UNIX-подобных системах с полными правами"
            },
            {
            "term": "Корневой доступ",
            "definition": "Полноценный доступ ко всем данным и управлению компьютером/машиной UNIX"
            },
            {
            "term": "Корэл",
            "definition": "Графический редактор CorelDraw для работы с векторными изображениями"
            },
            {
            "term": "Костыль",
            "definition": "Наскоро реализованное решение проблемы в готовом коде. Является временной мерой, поддерживающей работоспособность программы, пока программисты трудятся над качественным глобальным решением"
            },
            {
            "term": "Котёнок",
            "definition": "В Фидонете: неформальное название мейлера KittenMail"
            },
            {
            "term": "Кракер",
            "definition": "Опытный программист, который пишет кряки для взлома программной системы защиты"
            },
            {
            "term": "Кракозябры",
            "definition": "Набор случайных/непонятных символов, которые не поддаются расшифровке"
            },
            {
            "term": "Красная Шапочка",
            "definition": "Операционная система Linux Red Hat"
            },
            {
            "term": "Красный глаз",
            "definition": "Инфракрасный порт, передатчик данных, работающий в инфракрасном диапазоне"
            },
            {
            "term": "Кресты",
            "definition": "Язык программирования C++, широко используемый для разработки ПО, ОС, серверов, игр"
            },
            {
            "term": "Кроссплатформенный",
            "definition": "ПО/сайт, который способен работать на нескольких аппаратных платформах и ОС"
            },
            {
            "term": "Крыса",
            "definition": "Манипулятор типа «мышь» советского производства, отличающаяся от современных огромными размерами"
            },
            {
            "term": "Крысодром",
            "definition": "Коврик для манипулятора \"мышь/крыса\""
            },
            {
            "term": "Крэш-полл",
            "definition": "Непрерывная частая прозвонка на ноду, игнорирующая флаг времени работы ноды"
            },
            {
            "term": "Кряк",
            "definition": "Специальная программа или дополнение для взлома платного ПО, делающее возможным его бесплатное использование"
            },
            {
            "term": "Крякнуть",
            "definition": "Взломать программу/систему защиты ПО"
            },
            {
            "term": "Ксерить",
            "definition": "Снимать копию бумажных документов с помощью ксерокса (копировального аппарата)"
            },
            {
            "term": "Ксерокс",
            "definition": "Копировальный аппарат для создания ч/б или цветных копий бумажной документации. Является именем нарицательным для всех копировальных машин, хотя раньше обозначало лишь аппарат фирмы Xerox"
            },
            {
            "term": "Ку",
            "definition": "Приветствие в чате/мессенджере, побуждающее начать разговор. Произошло от приветствия в фильме Кин-Дза-Дза"
            },
            {
            "term": "Кубизм",
            "definition": "Философия создания интернет-ресурсов, в соответствии с которой пользователь является и создателем, и потребителем контента"
            },
            {
            "term": "Куки",
            "definition": "Небольшой файл текстового формата, который сайт посылает на диск пользователя для его идентификации и сохранения настроек"
            },
            {
            "term": "Кулер",
            "definition": "Система охлаждения, состоящая из вентилятора + радиатора, предназначенная для защиты от перегрева процессора, видеокарты, блока питания или прочих устройств"
            },
            {
            "term": "Кулхацкер",
            "definition": "Человек, который считает себя куртым программистом/хакером, хотя, на самом деле, таким не является"
            },
            {
            "term": "Кэмэдэ",
            "definition": "Разновидность текстового интерфейса. Одна из возможностей ОС, позволяющая вводить команды MS-DOS и других компьютерные команды"
            },
            {
            "term": "Кэмэдэшник",
            "definition": "Пакетный файл семейства ОС Windows NT, имеющий расширение .cmd"
            }
        ],
        "Л": [
            {
            "term": "Лаг",
            "definition": "Торможение или медленная работа какой-либо системы, к примеру, программы или компьютерной игры. Возникает по причине недостаточных характеристик устройства, либо из-за низкой скорости интернета (если речь о передаче данных по сети)"
            },
            {
            "term": "Лайфхак",
            "definition": "\"Хитрости жизни\", \"народная мудрость\", т.е. полезный совет, который помогает решить какую-то проблему/задачу с экономией времени/усилий"
            },
            {
            "term": "Ламер",
            "definition": "1) Неопытный пользователь, человек, не разбирающийся в чём-либо, но при этом думающий, что все знает, «воинствующий» чайник; 2) Среди пиратов, кракеров и фрикеров: слово синоним “лузера”, “пиявка” - тот, кто скачивает много файлов, ничего не давая взамен"
            },
            {
            "term": "Лапша",
            "definition": "Множество проводов, кабелей - обычно телефонных"
            },
            {
            "term": "Левел",
            "definition": "В геймерской среде означает уровень, который достиг игрок, либо характеристику его успешности. В широком употреблении может означать степень успешности/навыков/способностей"
            },
            {
            "term": "Легаси-код",
            "definition": "Изживший себя код, который был написан кем-то очень давно и с которым программистам теперь приходится работать"
            },
            {
            "term": "Лейбл",
            "definition": "Отличительный знак/наклейка на любом товаре/it-продукте, на которой указаны марка производителя, название, дата производства и т.д."
            },
            {
            "term": "Лечить",
            "definition": "1) Проверять и спасать компьютер от вирусных программ; 2) Фиксить (исправлять) баги, обычно самым наипростейшим способом, по принципу временного латания дыр; 3) Применять лекарство (кряк) к платной программе"
            },
            {
            "term": "Либа",
            "definition": "В программировании имеется ввиду библиотека кода или DLL в Windows"
            },
            {
            "term": "Ликбез",
            "definition": "Расшифровывается как 'ликвидация безграмотности', т.е. обучение неким азам, фундаментальным основам"
            },
            {
            "term": "Линк",
            "definition": "1) Гипертекстовая ссылка на какой-либо сайт/ресурс/документ/урл (URL); 2) Единица измерения, ранее бывшая в употреблении в Америке, равная 20,11 см"
            },
            {
            "term": "Линкануть",
            "definition": "Отправить кому-то необходимую ссылку на какой-либо ресурс"
            },
            {
            "term": "Линкинг",
            "definition": "Процесс связывания всех объектных файлов, которые генерирует компилятор, в единую программу с возможностью последующего запуска/выполнения с помощью линкера/компоновщика"
            },
            {
            "term": "Линтер",
            "definition": "Собирательное название программ, анализирующих написанный код и предупреждающих программиста об обнаруженных ошибках"
            },
            {
            "term": "Линукс",
            "definition": "Бесплатная, полностью готовая ОС на основе ядра Linux. Исходные коды Linux доступны для изменений и просмотров любым юзером"
            },
            {
            "term": "Линуксоид",
            "definition": "Человек/юзер, пользующийся ОС Linux (Линукс)"
            },
            {
            "term": "Лиса",
            "definition": "Свободный браузер Mozilla Firefox с открытым исходным кодом, основанный в 2003 году"
            },
            {
            "term": "Лист",
            "definition": "Изменяемый список, структура данных для хранения объектов различных типов, построенная на двусвязных списках"
            },
            {
            "term": "Литерал",
            "definition": "Константа, фиксированное значение, записанное непосредственно в исходном коде программы, которые, в последствии, нельзя изменить"
            },
            {
            "term": "Лицуха",
            "definition": "(От лат. liсentia - «право») - лицензия/разрешение на выполнение некоторых действий, подтвержденное определенным документом. В мире it обычно имеется ввиду лицензия на ПО, дающая право на его использование"
            },
            {
            "term": "Личер",
            "definition": "Пользователь файлообменной сети, который пользуется ресурсами других и лишь скачивает файлы, ничего не загружая взамен"
            },
            {
            "term": "Личка",
            "definition": "Личные сообщения: форма общения в Интернет-пространстве между двумя людьми, суть которой заключается в приватности диалога"
            },
            {
            "term": "Логин",
            "definition": "Имя учётной записи пользователя на ресурсе/в ПО, используемое для авторизации (входа в систему)"
            },
            {
            "term": "Логиниться",
            "definition": "Процесс входа в систему (авторизация в ПО, на сайте) под ранее зарегистрированной учетной записью путём ввода логина и пароля"
            },
            {
            "term": "Лого",
            "definition": "Логотип: уникальный графический элемент (эмблема), используемый компаниями/брендами для идентификации себя на рынке"
            },
            {
            "term": "Логофф",
            "definition": "Выход из системы (действие, противоположное авторизации), переход в режим незарегистрированного использователя ПО/сайта"
            },
            {
            "term": "Лог-файл",
            "definition": "Текстовый файл (файл или таблица в базе данных) для внесения в последовательном порядке всех совершенных действия в ПО/сервере, к примеру: шаги юзеров, время произошедших ошибок и сбоев и тд."
            },
            {
            "term": "Локализовать",
            "definition": "Перевести ПО/ресурс на местный язык пользователей с помощью ANSI (локальной кодовой страницы)"
            },
            {
            "term": "Локализовать багу",
            "definition": "Процесс 'расследования' произошедшего бага (ошибки): поиск ее в коде, выяснение причины произошедшего, изучение последствий"
            },
            {
            "term": "Локаль",
            "definition": "1) Локальная кодовая страница (ANSI) с региональными настройками, некий стандарт, определяющий некоторые параметры: язык, часовой пояс и т.д."
            },
            {
            "term": "Локейшн",
            "definition": "Месторасположение (в it обычно применяется к геолокации юзера, либо месту хранения файла)"
            },
            {
            "term": "Лэптоп",
            "definition": "Собирательное название портативных ПК: ноутбуков, нетбуков, смартбуков, планшетов и т.д."
            }
        ],
        "М": [
            {
                "term": "Маздай",
                "definition": "Оперативная система Windows (от популярного выражения «Windows 95 must die»)"
            },
            {
                "term": "Мазила",
                "definition": "Свободный браузер Mozilla Firefox на движке Quantum, разработанный Mozilla Corporation"
            },
            {
                "term": "Майнинг",
                "definition": "Сейчас ассоциируется, в основном, с добычей криптовалюты с помощью мощных компьютеров, выполняющих сложные математические операции"
            },
            {
                "term": "Макрос",
                "definition": "1) Программный алгоритм действий, написанный пользователем (обычно применяются для выполнения рутинных действий); 2) Символьное имя в шаблонах, заменяемое при обработке препроцессором на последовательность символов"
            },
            {
                "term": "Малварь",
                "definition": "Вредоносное программное обеспечение, созданное с целью нанести урон пользователю или компьютеру с его содержимым"
            },
            {
                "term": "Манагер",
                "definition": "1) Менеджер, руководитель компании/отделения/проекта; 2) Иногда, манагером пренебрежительно называют бездарного руководителя, который не умеет принимать решения и нести ответственность"
            },
            {
                "term": "Мануал",
                "definition": "Краткое руководство пользователя, инструкция по использованию чего-то: ПО, оборудования, сервиса и т.д."
            },
            {
                "term": "Массив",
                "definition": "Совокупный тип данных, позволяющий посредством использования единого идентификатора заиметь доступ ко всем переменным одного и того же типа данных"
            },
            {
                "term": "Мастер",
                "definition": "Компьютер, который управляет трояном на 'зомби' (на зараженном ПК), некоторые мастера способны удаленно управлять в ботнетах огромным количеством 'зомби', организуя атаки ДДоС"
            },
            {
                "term": "Мейл",
                "definition": "1) Электронное письмо/сообщение; 2) Иногда 'мейлом' называют конкретную почтовую службу Mail.Ru"
            },
            {
                "term": "Мейнстрим",
                "definition": "Направление/течение, которое в определенное время является популярным и преобладает в какой-либо сфере общественной жизни: научной, культурной, технической и т.д."
            },
            {
                "term": "Мелкомягкие",
                "definition": "Компания Microsoft и все продукты, которые она выпускает"
            },
            {
                "term": "Ментор",
                "definition": "Наставник/учитель, опытный руководитель, который является носителем ценных знаний и умений"
            },
            {
                "term": "Меншить",
                "definition": "Упоминание имени другого пользователя в чатах/группах/соц. сетях с целью привлечь его внимание к диалогу или же предоставить прямую ссылку на него для удобства поиска другими участниками беседы"
            },
            {
                "term": "Меню",
                "definition": "Определенный набор/список команд в приложении/ПО/на сайте, с помощью которых можно выполнять необходимые операции"
            },
            {
                "term": "Мёржить",
                "definition": "Производить объединение/слияние нескольких веток кода или данных таблиц"
            },
            {
                "term": "Мессага",
                "definition": "Сообщение/письмо в интернет-пространстве (на эл. почте, в чате, ICQ и т.д.)"
            },
            {
                "term": "Метр",
                "definition": "Вариант названия единицы измерения информации, равной 1 мегабайту"
            },
            {
                "term": "Мидл",
                "definition": "Средний уровень навыков/знаний программиста в общепринятой системе измерения (джуниор/мидл/сеньор)"
            },
            {
                "term": "Мировая паутина",
                "definition": "Объединенная система всех ресурсов сети Интернет, которые используют протокол HTTP ('протокол передачи гипертекста')"
            },
            {
                "term": "Митап",
                "definition": "Сходка/встреча специалистов из одной или близких сфер работы для взаимного обмена накопленным опытом, а иногда просто для неформального общения"
            },
            {
                "term": "Митинг",
                "definition": "В it-сфере термин употребляется применительно к собраниям/встречам, на которых обсуждаются итоги в проведенной работы, выявляются сложности и недоработки, ставятся новые цели и задачи"
            },
            {
                "term": "Модем",
                "definition": "Устройство, которое осуществляет модуляцию (изменение характеристик в соответствии с изменениями входного информационного сигнала) и демодуляцию (обратный процесс при приёме данных из канала связи)"
            },
            {
                "term": "Модемный пул",
                "definition": "Совокупность всех модемов интернет-провайдера, которые конструктивно и логически объединены между собой и служат для обеспечения абонентов доступом к сети Интернет"
            },
            {
                "term": "Модератор",
                "definition": "Пользователь ресурса, который имеет более узкие права, чем администратор. В его функции входит следить за фактами нарушений правил (в конференции, на форуме) и пресекать их с помощью предупреждений, бана и т.д."
            },
            {
                "term": "Модераториал",
                "definition": "В фидонете так называется 'санкция' от модератора. Обычно это: предупреждение [*], строгое предупреждение [+], выговор с занесением [!] и ридонли (запрет писать сообщения) [r/o]"
            },
            {
                "term": "Моник",
                "definition": "Монитор, устройство вывода визуальной информации с компьютера"
            },
            {
                "term": "Мониторить",
                "definition": "Просматривать и собирать необходимую информацию в открытых источниках, наблюдение/отслеживание чего-либо"
            },
            {
                "term": "Муар",
                "definition": "Некий 'рисунок'/узор, который возникает при наложении двух периодических сетчатых рисунков (часто наблюдается при сканировании, растрировании изображений)"
            },
            {
                "term": "Мулька",
                "definition": "1) Полезная фича, какая-то 'изюминка' в ПО/приложении, скрытая доп. функция; 2) Этикетка, ярлычок, фирменный лого (обычно на одежде)"
            },
            {
                "term": "Мультикаст",
                "definition": "Передача информации сразу всей группе нуждающихся в ней получателей"
            },
            {
                "term": "Мылить",
                "definition": "Процесс отправки сообщений по электронной почте"
            },
            {
                "term": "Мыло",
                "definition": "Индивидуальный адрес электронной почты пользователя"
            },
            {
                "term": "Мыльница",
                "definition": "Почтовая программа по обмену электронными письмами, т.е. почтовый ящик"
            },
            {
                "term": "Мыша",
                "definition": "Манипулятор/устройство для координации работы курсора и передачи необходимых команд ПК"
            },
            {
                "term": "Мышкодром",
                "definition": "Коврик для мыши, поверхность для удобной работы с манипулятором типа 'мышь'"
            },
            {
                "term": "Мэйлер",
                "definition": "Программа, обеспечивающая отправку и прием почты"
            }
        ],
        "Н": [
            {
            "term": "Навбар",
            "definition": "Блок с навигацией на сайте или экранная навигационная панель в интерфейсе программы"
            },
            {
            "term": "Накатить",
            "definition": "Внести изменения, развернуть, опубликовать новую рабочую версию приложения. Противоположное термину «откатить»"
            },
            {
            "term": "Накрутка",
            "definition": "Целенаправленные действия с целью увеличения каких-либо показателей (например, лайков, репостов или подписчиков)"
            },
            {
            "term": "Наладонник",
            "definition": "Карманный персональный компьютер, прародитель современных коммуникаторов и смартфонов"
            },
            {
            "term": "Нативный",
            "definition": "Часто используют в словосочетании 'нативный код', что обозначает исходный код, написанный разработчиками, который не модифицировался позже"
            },
            {
            "term": "Нетбиос",
            "definition": "Протокол Microsoft Windows для работы и коммуникации ПК в сетях локального типа"
            },
            {
            "term": "Нетворкинг",
            "definition": "Среда/круг профессионалов определённого направления, в котором, посредством общения, можно решить определенные задачи и проблемы, а также завести полезные знакомства"
            },
            {
            "term": "Нетмейл",
            "definition": "В фидонете аналог электронной почты для обмена личными письмами (в противовес эхомэйлу)"
            },
            {
            "term": "Нетшкаф",
            "definition": "Браузер Netscape Navigator, выпускавшийся фирмой Netscape с 1994 по 2007 год"
            },
            {
            "term": "Не эхотажно",
            "definition": "В фидонете означает что 'нечто' не относится к эхотагу, т.е. к теме конференции"
            },
            {
            "term": "Ник",
            "definition": "Псевдоним/прозвище пользователя в сети (на сайте, в соц.сети, на форуме)"
            },
            {
            "term": "Нода",
            "definition": "Узел сети фидо: любой ПК, подсоединенный к блокчейн-сети"
            },
            {
            "term": "Нодедифф",
            "definition": "Файл изменений и дополнений структуры узлов Фидо (список новых и покинувших)"
            },
            {
            "term": "Нодлист",
            "definition": "Список узлов сети Фидонет, который еженедельно обновляется"
            },
            {
            "term": "НОК",
            "definition": "То же, что дата-центр (место для удаленного хранения и обработки данных серверов, находящихся в нем на хостинге)"
            },
            {
            "term": "Ноулайфер",
            "definition": "Человек, который практически все свое свободное время проводит с гаджетом в виртуальном мире (Интернете/соц.сетях/играх), в связи с чем не имеет личной жизни, увлечений и других дел в мире настоящем"
            },
            {
            "term": "Ноут",
            "definition": "Сокращенно от ноутбук (переносной портативный компьютер)"
            },
            {
            "term": "Нуб",
            "definition": "Неопытный новичок, человек, имеющий проблемы с пониманием или применением чего-то"
            }
        ],
        "О": [
            {
            "term": "Область видимости",
            "definition": "Концепция, которая определяет, где можно использовать переменную, т.е. её доступность в коде"
            },
            {
            "term": "Обои",
            "definition": "Фоновый рисунок на рабочем столе компьютера, телефона или планшета"
            },
            {
            "term": "Обработка исключений",
            "definition": "Алгоритм обработки ошибок, которые возникают в функции и с которыми она самостоятельно не может справиться"
            },
            {
            "term": "Оверквотинг",
            "definition": "Избыток цитат в написанном тексте или цитирование технической информации, крайне не приветствуется в сети"
            },
            {
            "term": "Оверклокинг",
            "definition": "Увеличение производительности компьютера, разгон комплектующих: видеокарта, процессор, память"
            },
            {
            "term": "Овертайм",
            "definition": "Время, которое специалист перерабатывает после окончания установленного рабочего дня, т.е. сверхурочные часы"
            },
            {
            "term": "Окирпичить",
            "definition": "Испортить какой-либо гаджет в процессе неудачной перепрошивки, превратить в 'кирпич' (неработающий бесполезный прибор)"
            },
            {
            "term": "Окна",
            "definition": "Так иногда называют операционную систему Microsoft Windows из-за логотипа в виде окна"
            },
            {
            "term": "Околоайтишник",
            "definition": "Специалист, не являющийся айтишником/программистом, но работающий вместе с ними в области IT"
            },
            {
            "term": "Оля",
            "definition": "Технология Object Linking and Embedding, дающая возможность вносить изменения в данные, которые были созданы в иной программе"
            },
            {
            "term": "Онлайн",
            "definition": "1) Пребывание пользователя в активном режиме; 2) Общение в реальном времени"
            },
            {
            "term": "ООП",
            "definition": "Методология/подход в программировании, в рамках которого программы представляются в виде совокупности объектов"
            },
            {
            "term": "Опенсорс",
            "definition": "ПО с исходным кодом открытого типа, который может использовать/дополнять/редактировать любой желающий"
            },
            {
            "term": "Опенспейс",
            "definition": "Рабочее пространство открытого типа без стен и перегородок"
            },
            {
            "term": "Операнды",
            "definition": "Аргумент операции, данные, с которыми работает выражение"
            },
            {
            "term": "Оперативка",
            "definition": "Оперативная энергозависимая память ПК, отличающаяся от ПЗУ высокой скоростью чтения/записи"
            },
            {
            "term": "Оптика",
            "definition": "Сетевой оптоволоконный кабель, созданный из стекла и пластика, посредством которого происходит передача луча"
            },
            {
            "term": "Оракл",
            "definition": "База данных Oracle Database или Oracle RDBMS"
            },
            {
            "term": "Ориджин",
            "definition": "Крайняя строка письма в эхопочте, которая содержит адрес отправителя"
            },
            {
            "term": "ОС",
            "definition": "Операционная система, комплекс ПО, позволяющий управлять аппаратной частью и ресурсами ПК"
            },
            {
            "term": "Ослик",
            "definition": "Браузер Internet Explorer, который интегрирован в ОС Windows"
            },
            {
            "term": "Откат",
            "definition": "Процесс возвращения к исходной версии ПО при обнаружении ошибок"
            },
            {
            "term": "Откатить",
            "definition": "Убрать внесенные ранее изменения, вновь вернув предыдущую версию программы"
            },
            {
            "term": "Отконнектиться",
            "definition": "Отсоединиться от чего-либо"
            },
            {
            "term": "Отладчик",
            "definition": "ПО, посредством которого автоматизируется процесс поиска ошибок кода"
            },
            {
            "term": "Отлаживать",
            "definition": "Заниматься отладкой, т.е. поиском ошибок в коде ПО"
            },
            {
            "term": "Отлогиниться",
            "definition": "Выйти из режима зарегистрированного пользователя системы"
            },
            {
            "term": "Отревьюить",
            "definition": "Просмотреть на предмет ошибок, прокомментировать, дать рецензию"
            },
            {
            "term": "Офлайн",
            "definition": "Нахождение пользователя 'не в сети', или общение 'по факту прочтения'"
            },
            {
            "term": "Офсайт",
            "definition": "Официальный сайт компании или проекта"
            },
            {
            "term": "Офтопик",
            "definition": "Сообщение, отличающееся по тематике от главной темы конференции"
            },
            {
            "term": "Оффер",
            "definition": "Предложение о работе, с указанием должности, обязанностей и зарплаты"
            },
            {
            "term": "Очепятка",
            "definition": "Опечатка, ошибка в написанном слове"
            }
        ],
        "П": [
            {
            "term": "Пага",
            "definition": "домашняя страница, WEB-страничка пользователя, его персональный сайт"
            },
            {
            "term": "Падаван",
            "definition": "ироничное шутливое название стажёра или джуниора в IT-сфере"
            },
            {
            "term": "Палка",
            "definition": "1) слеш - косая черта, наклоненная вправо; 2) модуль оперативной памяти"
            },
            {
            "term": "Папка",
            "definition": "экранный объект в графических интерфейсах ОС и программ, некий контейнер, дающий доступ к каталогу файловой системы. Если внутри папки имеются другие папки, то их называют вложенными"
            },
            {
            "term": "Паркинг",
            "definition": "услуга провайдера по хранению неактивных, но зарегистрированных доменных имен"
            },
            {
            "term": "Парковаться",
            "definition": "хранить на сервере/у провайдера зарегистрированное, но не активное доменное имя (без сайта)"
            },
            {
            "term": "Парсер",
            "definition": "1) участок кода, который ответственен за разбор; 2) круг подпрограмм, которые могут сканировать сайт, собирать и обрабатывать информацию, при этом выдавая себя за обычного посетителя; 3) объектно-ориентированный скриптовый язык программирования, предназначенный для создания HTML-страниц на веб-сервере с поддержкой CGI"
            },
            {
            "term": "Парсить",
            "definition": "сбор и анализ информации из открытых источников, разбор чего либо"
            },
            {
            "term": "Паскаль",
            "definition": "один из самых известных языков программирования Pascal, представляющий собой чисто процедурный язык, который служит основой для ряда других языков"
            },
            {
            "term": "Паттерн",
            "definition": "1) наиболее эффективный способ решения характерных задач проектирования, в т.ч. проектирования ПО; 2) в графическом дизайне: бесшовный узор с неоднократно повторяющимися элементами"
            },
            {
            "term": "Патч",
            "definition": "дополнение или обновление it-продукта (ПО/приложения), исправляющее обнаруженные ошибки/баги/глюки (процесс применения патча - пропатчивание, пропатчить)"
            },
            {
            "term": "Патч-корд",
            "definition": "кабель для сопряжения различных устройств друг с другом и подключения активного сетевого оборудования к сети Интернет"
            },
            {
            "term": "Паутина",
            "definition": "мировая сеть/сложная структура ,связанных между собой посредством гиперссылок , HTML-документов"
            },
            {
            "term": "Пень",
            "definition": "центральный процессор торговой марки Pentium, выпускаемый компанией Intel"
            },
            {
            "term": "Перегрузка функций",
            "definition": "это возможность определять несколько одноименных функций с разными параметрами"
            },
            {
            "term": "Переполнение",
            "definition": "ситуация, когда вся память занята, т.е. запрашиваемый объем отсутствует в наличии"
            },
            {
            "term": "Периферия",
            "definition": "все внешние устройства ввода и вывода (железо), которые можно подключить к ПК"
            },
            {
            "term": "Перл",
            "definition": "язык программирования Perl, использующийся для разработки скриптов в UNIX-системах"
            },
            {
            "term": "Песочница",
            "definition": "1) специальная область/место/среда, где программа может безопасно выполнятся; 2) на сайте одноименный раздел выделяет категорию для записей новичков (некий фильтр)"
            },
            {
            "term": "Петля",
            "definition": "фрагмент аудио или видео записи, который замыкается в кольцо (петлю) для цикличного воспроизведения"
            },
            {
            "term": "Пет-проект",
            "definition": "проект (чаще всего личный), который создается и развивается исключительно для получения опыта или как хобби (изредка перерастает в полноценный проект или даже компанию)"
            },
            {
            "term": "Пик Балмера",
            "definition": "шуточная теория, выдвинутая Стивом Балмером. Она утверждает, что при наличии алкоголя в крови в промежутке от 0,129 до 0,138% (около 2 банок пива) программист обретает суперспособности к написанию кода"
            },
            {
            "term": "Пилить (жечь) болванку",
            "definition": "производить запись каких-либо файлов на диск (CD-R, CD-RW, DVD-R, DVD-RW)"
            },
            {
            "term": "Пилот",
            "definition": "1) тестовая (пилотная) версия продукта, либо отдел фирмы, выбранный для опробации/обкатывания этого продукта; 2) сетевой фильтр для сохранения техники от поломок, связанных со скачками напряжения"
            },
            {
            "term": "Пинг",
            "definition": "программа для проверки связи в сети, ее целостности и качества; 2) характеристика скорости сетевого соединения, т.е. время прохождения пакета данных до адресата и обратно (измеряется в миллисекундах)"
            },
            {
            "term": "Пинговать",
            "definition": "проводить проверку ресурса на доступность с использованием утилиты «Ping»"
            },
            {
            "term": "Пинч",
            "definition": "«щипающее» движение пальцами на тачскрине, которое позволяет уменьшить размер/масштаб изображения/страницы"
            },
            {
            "term": "Пират",
            "definition": "человек, занимающийся воровством и незаконной продажей запатентованного авторского контента (фильмы, музыка, книги и т.д.)"
            },
            {
            "term": "Пиратка",
            "definition": "нелицензионные программы/утилиты/ОС, скаченные с \"пиратских\" ресурсов"
            },
            {
            "term": "Писиспикер",
            "definition": "динамик, который встроен непосредственно в компьютер (обычно издает лишь писк для диагностики, но можно вывести и звук со звуковой карты)"
            },
            {
            "term": "Писюк",
            "definition": "персональный компьютер"
            },
            {
            "term": "Питон",
            "definition": "популярный высокоуровневый язык программирования общего назначения, отличающийся хорошей читабельностью кода и чистым выразительным синтаксисом"
            },
            {
            "term": "Планка",
            "definition": "отдельный модуль оперативной памяти, содержащий микросхемы запоминающего устройства"
            },
            {
                "term": "Плюсомёт",
                "definition": "в Фидонете метафоричное название оружия модератора, которым он раздаёт плюсы [+], т.е. строгие предупреждения за нарушения правил эхи"
            },
            {
                "term": "Плюшки",
                "definition": "некие бонусы/привилегии, что-то полезное и нужное (часто относятся к условиям работы или функциям приложения)"
            },
            {
                "term": "ПМК",
                "definition": "советский программируемый микрокалькулятор типа «Электроника Б3-34» и «МК-54/-56/-61/-52»"
            },
            {
                "term": "ПО",
                "definition": "программное обеспечение: одна или несколько программ (комплекс), которые используются для нормального функционирования компьютера"
            },
            {
                "term": "Побитовые операции",
                "definition": "операции над отдельными битами (цепочками битов) в границах одной переменной, в т.ч. битовые сдвиги и применение побитовых операторов"
            },
            {
                "term": "Повесить",
                "definition": "1) выполнить какое-либо действие, которое приведет к зависанию компьютера/сервера/программы и т.д.; 2) свернуть документ или окно в панель задачь"
            },
            {
                "term": "Подвал",
                "definition": "в веб-дизайне так называют нижнюю часть страницы/сайта, содержащую служебную информацию"
            },
            {
                "term": "Подкаст",
                "definition": "цикл уроков видео или аудио формата, рассказы/лекции по определённой тематике, чаще всего образовательного характера"
            },
            {
                "term": "Подставка под кофе",
                "definition": "компакт-диск или дисковод (выезжающая панель CD-RОM)"
            },
            {
                "term": "Поженить",
                "definition": "сделать так, чтобы что-то одно соответствовало чему-то другом"
            },
            {
                "term": "Поинт",
                "definition": "1) член сети фидо, который не держит станцию, а пользуется адресом своего узла-босса; 2) низовой пользователь Фидонета, который не имеет даунлинков"
            },
            {
                "term": "Пойнтлист",
                "definition": "список пойнтов некоторого узла/сети/региона"
            },
            {
                "term": "Пойнтовка",
                "definition": "вечеринка/тусовка/сходка фидошников"
            },
            {
                "term": "Полететь",
                "definition": "удалиться, перестать корректно работать/функционировать (относится к программам, драйверам, сайтам и т.д.)"
            },
            {
                "term": "Полиси",
                "definition": "устав сети Фидонет, утвержденный голосованием ее координаторов"
            },
            {
                "term": "Полл",
                "definition": "команда/файл, появление которых активирует прозвонку на ноду"
            },
            {
                "term": "Полуось",
                "definition": "операционная система OS/2 фирмы IBM, которая до 1992 года разрабатывалась с участием Microsoft"
            },
            {
                "term": "Попап",
                "definition": "всплывающее окно на сайте/в приложении, обычно рекламного характера"
            },
            {
                "term": "Поплыла вёрстка",
                "definition": "ситуация, когда страницы браузере отображаются некорректно (например, со сдвигом важных элементов интерфейса)"
            },
            {
                "term": "Пост",
                "definition": "опубликованная запись/публикация/статья в интернет-пространстве (соц.сети, форуме, блоге)"
            },
            {
                "term": "Постинг",
                "definition": "процесс создания и публикации постов в интернет-пространстве"
            },
            {
                "term": "Постить",
                "definition": "1) делать и публиковать посты в соцсетях, в блоге, на форуме; 2) в Фидонете означает процесс отправки сообщения в эху"
            },
            {
                "term": "Пофиксить",
                "definition": "исправить/наладить работу, внести необходимые правки"
            },
            {
                "term": "Поюзанный",
                "definition": "нечто, использовавшееся ранее, бывшее в употреблении (б/у)"
            },
            {
                "term": "Поюзать",
                "definition": "попробовать в использовании что-то (например, новый гаджет), протестировать неизвестный ранее функционал"
            },
            {
                "term": "Превьюшка",
                "definition": "компактные/уменьшенные в несколько раз изображения (миниатюры) для более удобного предварительного просмотра"
            },
            {
                "term": "Препроцессор",
                "definition": "модуль компилятора, который целиком обрабатывает каждый предназначенный для компиляции файл и формирует текст, попадающий затем на вход компилятора"
            },
            {
                "term": "Приват",
                "definition": "личная/приватная переписка двух участников чата/форума/социальной сети, недоступная для просмотра остальным пользователям"
            },
            {
                "term": "Прикрепление",
                "definition": "файлы, прикрепленные к электронному письму (документы, видео и аудио записи, изображения и т.д.)"
            },
            {
                "term": "Провайдер",
                "definition": "компания, предоставляющая юзерам доступ к сети Интернет и дополнительные связанные с этим услуги"
            },
            {
                "term": "Провалиться",
                "definition": "1) раскрыть выпадающее меню приложения/сайта для просмотра детализированных данных; 2) перейти по клику из общей формы к необходимому файлу/документу"
            },
            {
                "term": "Прога",
                "definition": "программа/программное обеспечение/утилита"
            },
            {
                "term": "Прогать",
                "definition": "заниматься программированием, писать код программы/приложения"
            },
            {
                "term": "Программа",
                "definition": "комбинация/набор/перечень данных инструкций, которые позволяют компьютеру корректно работать"
            },
            {
                "term": "Программер",
                "definition": "программист, человек, занимающийся программированием/разработкой ПО"
            },
            {
                "term": "Прод",
                "definition": "компьютер/сервер, где запускается готовое работоспособное приложение"
            },
            {
                "term": "Продакшн",
                "definition": "1) код для рабочей версии ПО/приложения; 2) в широком смысле: процесс создания какого-либо проекта или продукта (обычно, творческого)"
            },
            {
                "term": "Продолжительность жизни переменной",
                "definition": "показатель, который определяет период хранения переменной, когда она создается и где уничтожается"
            },
            {
                "term": "Продуктив",
                "definition": "1) реальная среда работы сайта, т.е. сам сайт, установленный на сервер и доступный для посетителей; 2) продуктивная эксплуатация программного продукта"
            },
            {
                "term": "Прокси-сервер",
                "definition": "некое ПО/сервер, являющийся промежуточным звеном (посредником) между юзером и конечным сайтом/сервером. Прокси-сервер позволяет одним компьютерам выполнять запросы к другим от своего имени, чтобы обеспечить приватность, конфиденциальность и затруднить возможность отслеживания пользователя"
            },
            {
                "term": "Прополоть",
                "definition": "в Фидонете: запустить прозвонку на ноду"
            },
            {
                "term": "Прорезать",
                "definition": "добавить в интерфейс ПО/приложения дополнительный объект/элемент, который не был предусмотрен ранее стандартным решением. Вместе с тем добавить его обработку в программный код, атак же в соответствующую таблицу базы данных"
            },
            {
                "term": "Пространство имен",
                "definition": "некоторая область кода, где гарантируется уникальность/оригинальность всех идентификаторов, их логическая группировка"
            },
            {
                "term": "Протокол",
                "definition": "определенный стандарт/правила/соглашения по обмену данными между различными устройствами"
            },
            {
                "term": "Прототип функции",
                "definition": "в языках Си и C++ так называют предварительное объявление функции, состоящее из ее имени, типа возврата функции и параметров (не содержит тело, т.е. основную часть функции)"
            },
            {
                "term": "Профан",
                "definition": "Человек без опыта в какой-либо сфере, совсем не разбирающийся в чём-то"
            },
            {
                "term": "Профит",
                "definition": "1) в широком смысле - определенный положительный результат чего-либо: прибыль/выгода/польза; 2) на бирже: разницу между вложенными инвестициями и полученным чистым доходом"
            },
            {
                "term": "Прошивка",
                "definition": "ПО/программный код, встроенный в энергонезависимую память устройства и управляющий его работой (модем, GPS-навигатор, смартфон, маршрутизатор и др.)"
            },
            {
                "term": "Прошить",
                "definition": "изменить прошивку, т.е отредактировать программный код устройства"
            },
            {
                "term": "Пул реквест",
                "definition": "запрос на подтверждение коммита, т.е. на изменение кода в чужом репозитории"
            },
            {
                "term": "Пушить",
                "definition": "1) использовать команду push, публиковать что-то, отправлять данные на сервер; 2) в маркетинговых и рекламных кампаниях - толкать (пушить) товар или услуги пользователю"
            }
        ],
        "Р": [
            {
            "term": "Радиобаттон",
            "definition": "элемент интерфейса, позволяющий пользователю выбрать только одну опцию из предопределенного набора. Обычно выглядит как пустой кружочек или ромбик. При выборе «зажигается»"
            },
            {
            "term": "Разраб",
            "definition": "сокращение от разработчик, с намеком на тяжелый и подневольный «рабский» труд"
            },
            {
            "term": "Рандом",
            "definition": "случайная вероятность получения определенного результата при совершении какого-либо действия"
            },
            {
            "term": "Рантайм",
            "definition": "вычислительное окружение, которое требуется для выполнения программы и доступное во время её выполнения"
            },
            {
            "term": "Рапида",
            "definition": "популярный файлообменный сервер Rapidshare, существовавший с 2005 по 2015 год"
            },
            {
            "term": "Рарить",
            "definition": "использовать программу-архиватор RAR для создания архивов"
            },
            {
            "term": "Расшарить",
            "definition": "сделать открытым доступом к ресурсу/файлу/папке в локальной сети с одним или несколькими людьми"
            },
            {
            "term": "Реал",
            "definition": "реальный мир, все, что находится вне сети Интернет"
            },
            {
            "term": "Реалтайм",
            "definition": "операционная система для обслуживания приложений реального времени, обрабатывающих данные по мере их поступления"
            },
            {
            "term": "Ребейс",
            "definition": "команда для синхронизации с главной веткой в git. Обычно производится перед началом и после завершения работы над фичей"
            },
            {
            "term": "Ребзя",
            "definition": "обращение к группе людей, означает ребята или парни"
            },
            {
            "term": "Ребутнуть",
            "definition": "перезагружать электронное устройство или систему"
            },
            {
            "term": "Ревью",
            "definition": "рецензирование кода с целью обнаружения и исправления ошибок"
            },
            {
            "term": "Регэкспы",
            "definition": "формальный язык для поиска и манипуляций с подстроками в тексте, основанный на метасимволах"
            },
            {
            "term": "Редизайн",
            "definition": "обновление и модификация визуальной или функциональной составляющей приложения или сайта"
            },
            {
            "term": "Редирект",
            "definition": "автоматическое перенаправление пользователя на другой сайт, страницу или почту"
            },
            {
            "term": "Резак",
            "definition": "устройство для нарезки оптических дисков: CD, DVD"
            },
            {
            "term": "Рекурсивная функция",
            "definition": "функция, которая вызывает саму себя в своем определении"
            },
            {
            "term": "Рекурсия",
            "definition": "описание объекта или процесса с помощью самого этого объекта или процесса"
            },
            {
            "term": "Релиз",
            "definition": "выпуск готовой стабильной версии продукта, прошедшей тестирование"
            },
            {
            "term": "Рендер",
            "definition": "изображение или модель, сгенерированная в 3D-редакторе"
            },
            {
            "term": "Рендеринг",
            "definition": "преобразование данных в выходной формат или создание цифрового растрового изображения из 3D-сцены"
            },
            {
            "term": "Репозиторий",
            "definition": "хранилище исходных файлов проекта, таких как программы и метаданные"
            },
            {
            "term": "Рефакторинг кода",
            "definition": "корректировка кода для его упрощения, улучшения понимания и последующей поддержки"
            },
            {
            "term": "Референс",
            "definition": "пример или образец, который служит ориентиром для ожидаемого результата"
            },
            {
            "term": "Ридми",
            "definition": "файл с документацией, инструкциями и информацией о программе, который нужно прочитать перед запуском ПО"
            },
            {
            "term": "Ридонли",
            "definition": "режим «только чтение», запрет редактирования файла или программы"
            },
            {
            "term": "Рисёрч",
            "definition": "поиск информации или изучение темы с целью разобраться в ней"
            },
            {
            "term": "РоР",
            "definition": "фреймворк для создания веб-приложений, написанный на языке Ruby"
            },
            {
            "term": "Роутинг",
            "definition": "процесс определения маршрута следования данных в сетях связи"
            },
            {
            "term": "Руби",
            "definition": "интерпретируемый язык программирования, используемый для разработки веб-приложений"
            },
            {
            "term": "Рубиться",
            "definition": "увлеченно играть или соревноваться"
            },
            {
            "term": "Ругаться",
            "definition": "выдача сообщений об ошибках или предупреждений в коде"
            },
            {
            "term": "Рулез",
            "definition": "выражение одобрения или похвалы чего-то (программы, проекта, ПО)"
            },
            {
            "term": "Рулесы",
            "definition": "правила, которые периодически постит модератор"
            },
            {
            "term": "Рунет",
            "definition": "русскоязычный сегмент Интернета"
            },
            {
            "term": "Рут",
            "definition": "учетная запись администратора, полный доступ к системе"
            },
            {
            "term": "Руткит",
            "definition": "ПО, которое захватывает контроль над системой, маскируя следы других программ"
            },
            {
            "term": "Рыбий глаз",
            "definition": "сверхширокоугольный объектив, создающий фото с характерной дисторсией"
            },
            {
            "term": "Рэк",
            "definition": "стандартная 19-дюймовая стойка для ИТ-оборудования"
            }
        ],
        "Т": [
            {
                "term": "Таглайн",
                "definition": "или «тэглайн», от англ. «TagLine» — строчка в конце письма, которая является необязательной. Обычно это часть подписи, в которой содержится крылатое выражение, цитата, шутка и т.д."
            },
            {
                "term": "Тап",
                "definition": "от англ. «tap» — короткое быстрое нажатие на элемент интерфейса дисплея телефона или планшета, по аналогии с щелчком мышью на компьютере. Соответственно, даблтап — двойное нажатие"
            },
            {
                "term": "Таска",
                "definition": "от англ. «task» — какое-либо задание/поручение"
            },
            {
                "term": "Таски",
                "definition": "от англ. «task» — заданные цели/задачи, которые предстоит решить"
            },
            {
                "term": "Тач",
                "definition": "от англ. «touch» — 1) используется как синоним тачпэда или тачскрина; 2) более продолжительное, чем \"тап\", нажатие на сенсорный экран мобильного гаджета. В десктопах аналога не имеет"
            },
            {
                "term": "Тачка",
                "definition": "так айтишники иногда называют свой компьютер"
            },
            {
                "term": "Тач-н-холд",
                "definition": "от англ. «touch and hold» — нажатие и продолжительное удержание пальца или стилуса на тачскрине"
            },
            {
                "term": "Тачпэд",
                "definition": "или «тачпад», от англ. «touch pad» — специальная сенсорная панель (на ноутбуке или клавиатуре для Smart TV), прикасаясь к которой можно отдавать команды подключенному устройству"
            },
            {
                "term": "Тачскрин",
                "definition": "от англ. «touch screen» — сенсорный экран/дисплей устройства (смартфона, планшета, смарт-часов, банкомата и т.д.), который реагирует на касания пальца и позволяет управлять гаджетом без использования кнопок"
            },
            {
                "term": "Твинк",
                "definition": "от англ. «Twink» он же Read-only-user — 1) в общем смысле: учетная запись, дающая пользователю право только на чтение (просмотр) документа/файла, без возможности редактирования; 2) на форумах: дополнительные учетные записи пользователя, созданные в качестве запасных на случай блокировки основной (иногда, для сокрытия своей личности)"
            },
            {
                "term": "Темплейт",
                "definition": "от англ. «template» — шаблон/заготовка, своего рода каркас для документа или письма"
            },
            {
                "term": "Тест",
                "definition": "от англ. «test» — 1) данные, которые были специально созданы (или подобраны) для организации тестирования продукта (ПО/приложения); 2) система тестирования (в отличие от продуктивной системы или системы разработки)"
            },
            {
                "term": "Тестировщик",
                "definition": "или «тестер», от англ. «tester» — it-специалист по тестированию ПО, находящегося в разработке"
            },
            {
                "term": "Технарь",
                "definition": "от англ. «technic» — 1) в широком смысле: любой человек с техническим (не гуманитарным) образованием; 2) специалист, работающий в бэкенде (бэкенд-разработчик)"
            },
            {
                "term": "Тимлид",
                "definition": "от англ. «team leader» — главный разработчик, человек, имеющий в подчинении свою команду разработчиков"
            },
            {
                "term": "Тирлайн",
                "definition": "или «тиарлайн», от англ. «TearLine» — в Фидонете: специальная строка, обозначающая завершение текста письма (начинается тремя минусами)"
            },
            {
                "term": "Тисипиайпи",
                "definition": "от англ. «TCP/IP» — сетевая модель передачи данных, представленных в цифровом виде. Модель описывает способ передачи данных от источника информации к получателю"
            },
            {
                "term": "Тиснуть",
                "definition": "сделать клик по кнопке/ссылке/иконке и т.д."
            },
            {
                "term": "Тонна",
                "definition": "терабайт, единица измерения количества цифровой информации"
            },
            {
                "term": "Топтать кнопки",
                "definition": "активно печатать что-либо на клавиатуре"
            },
            {
                "term": "Торрент",
                "definition": "или «BitTorrent» — технология передачи файлов через Интернет от пользователя к пользователю (без посредничества сервера). Позволяет быстро и эффективно загрузить необходимый файл"
            },
            {
                "term": "Тоссер",
                "definition": "или «эхотоссер», «эхопроцессор», от англ. «tosser» — в Фидонете: специальная программа, которая занимается тоссингом, т.е. обработкой баз сообщений"
            },
            {
                "term": "Тоссинг",
                "definition": "или «тоссенье», от англ. «toss» — размещение в базе сообщений почты, которую принял мейлер, а также сбор из этих баз уже написанных сообщений и подготовка их к отправке"
            },
            {
                "term": "Точка останова",
                "definition": "от англ. «breakpoint» — особый маркер, на котором прерывается процесс выполнения программы и вызывается отладчик"
            },
            {
                "term": "Трабл",
                "definition": "или «трабла», «грабли», от англ. «trouble» — беда, проблемы, хлопоты, неприятности"
            },
            {
                "term": "Транслитерация",
                "definition": "или «транслит», от англ. «transliteration» — точная побуквенная передача какого-либо текста одной языковой системы знаками/символами другой (например: «pr1vet», 4to delaesh?)"
            },
            {
                "term": "Трафик",
                "definition": "или «траффик», от англ. «traffic» — 1) массив информации в интернете; 2) количество данных, загруженных из интернета; 3) в Фидонете: объём писем в килобайтах, который за определенный временной отрезок проходит через станцию/конференцию"
            },
            {
                "term": "Трейни",
                "definition": "от англ. «trainee» — стажёр, младший сотрудник, работник, который не дотягивает знаниями/навыками до уровня Junior-специалиста"
            },
            {
                "term": "Тролль",
                "definition": "человек, намеренно провоцирующий ссоры и скандалы в различных коммуникационных сетях (чатах, форумах и т.д.)"
            },
            {
                "term": "Троян",
                "definition": "разновидность вредоносной программы, проникающая в компьютер под видом легитимного ПО и выполняющая команды с удаленного ПК"
            },
            {
                "term": "ТС",
                "definition": "или «топик стартер», от англ. «topic starter» — инициатор дискуссии, т.е. человек, предложивший к обсуждению какую-либо тему"
            },
            {
                "term": "ТСП",
                "definition": "или «туда-сюда протокол», «TCP», от англ. «Transmission Control Protocol» — транспортный протокол: один из основных протоколов, отвечающий за передачу данных и их сохранность"
            },
            {
                "term": "Тултип",
                "definition": "от англ. «tooltip» — подсказка, всплывающая при наведении курсора на какой-либо активный объект интерфейса"
            },
            {
                "term": "Туториал",
                "definition": "или «тутор», от англ. «tutorial» — свод подробных обучающих уроков на какую-либо тему"
            },
            {
                "term": "Тэдэшка",
                "definition": "или «ТД» — техническая документация: набор графических и текстовых документов проекта"
            },
            {
                "term": "ТэЗэ",
                "definition": "или «ТЗ», «техзадание, тэзэшка» — техническое задание: содержит основную информацию о цели и задачах проекта, принципах и правилах его выполнения"
            }
        ],
        "У": [
            {
            "term": "Убить",
            "definition": "означает стереть/удалить что-либо. Например: \"убить приложение\", \"убить эту версию сайта\"."
            },
            {
            "term": "Указатель",
            "definition": "от англ. «pointer» — переменная, представляющая собой адрес ячейки памяти."
            },
            {
            "term": "Упс",
            "definition": "или «UPS», от англ. «Uninterruptible Power Supply» — источник (устройство) беспрерывного питания."
            },
            {
            "term": "Урл",
            "definition": "или «урла», «урээл», от англ. «URL» — унифицированный указатель ресурса, определённый шаблон записи гипертекстовых ссылок на объекты в Интернете. Простыми словами, это адрес странички в Сети."
            },
            {
            "term": "Установочник",
            "definition": "или «дистрибутив», «инсталлятор», от англ. «set up» — программа, устанавливающая выбранное ПО на компьютер."
            },
            {
            "term": "Утечка памяти",
            "definition": "процесс неконтролируемого уменьшения объёма свободной оперативной или виртуальной памяти компьютера, связанный с ошибками в работающих программах, вовремя не освободивших ненужные участки памяти."
            },
            {
            "term": "Утилита",
            "definition": "или «утилитка», «тулза», от англ. «utility» — вспомогательное программное обеспечение, предназначенное для выполнения вспомогательных работ, настройки системного оборудования, операционных систем и прочего. Другими словами, программа, которая помогает что-то сделать."
            }
        ],
        "Ф": [
            {
            "term": "Фаервол",
            "definition": "или «брандмауэр», от англ. «fire wall» — программа-антивирус, обеспечивающая обнаружение и защиту компьютера от вирусов и вредоносных ПО."
            },
            {
            "term": "Файлопомойка",
            "definition": "или «файлообменник» — 1) файловый ресурс (BBS, ftp-сервер) с огромным перечнем беспорядочных несортированных похожих между собой файлов; 2) сервер сети с ресурсами, доступными для общего пользования, на который юзеры сохраняют всё, что необходимо."
            },
            {
            "term": "Файлэха",
            "definition": "или «фэха», «эха», от англ. «file» — русифицированное произношение английского file - \"файл\"."
            },
            {
            "term": "Фича",
            "definition": "от англ. «feature» — уникальная особенность/свойство/функция какого-либо объекта (ПО, приложения, ОС)."
            },
            {
            "term": "Флейм",
            "definition": "или «флэйм», «флэйминг», от англ. «flame» — \"спор ради спора\", дискуссия, в ходе которой давно утеряна изначальная суть, продолжается в грубой форме с переходом на личности."
            },
            {
            "term": "Флеймер",
            "definition": "или «флэймер», от англ. «flamer» — пособник флейма (спора ради спора) или человек, который по своему характеру склонен к его разжиганию и поддержанию."
            },
            {
            "term": "Флик",
            "definition": "от англ. «flick» — щелчок по дисплею сенсорного устройства наискосок, после которого происходит движение экрана в заданном направлении."
            },
            {
            "term": "Флоп",
            "definition": "или «флопик», «флопак», «флопарь», «флоповод», «флоповёрт», «флопогрыз», «флопоглот», от англ. «floppy» — флоппи-дисковод, предназначенный для считывания информации с дискеты (и записи на неё)."
            },
            {
            "term": "Флуд",
            "definition": "от англ. «flood» — засорение чатов или других каналов связи различной информацией, не имеющей отношения к тематике канала (мемы, картинки, текст, обилие сообщений)."
            },
            {
            "term": "Флудить",
            "definition": "от англ. «flood» — инициировать появление/генерирование флуда, т.е. обилия информации, не относящейся к теме канала."
            },
            {
            "term": "Флэшка",
            "definition": "или «флэха», «флешка», от англ. «flash drive» — 1) компактное переносимое запоминающее устройство, которое подключается к ПК через USB-порт; 2) программа на flash."
            },
            {
            "term": "Форвард",
            "definition": "или «форварднуть», «отфорвардить», от англ. «forward» — Форвард (форварднуть, отфорвардить, от forward) – переслать поступившее письмо другому пользователю."
            },
            {
            "term": "Формошлёп",
            "definition": "от англ. «form» — 1) человек с низкой квалификацией, работающий исключительно по готовым шаблонам; 2) специалист, занимающийся разработкой шаблонов веб-сайтов или их версткой (формошлёпством)."
            },
            {
            "term": "Форум",
            "definition": "от англ. «Forum» — некоторый сайт/ раздел, созданный с целью организации возможности общения пользователей ресурса."
            },
            {
            "term": "Форумчанин",
            "definition": "от англ. «Forum» — завсегдатай/участник, регулярно участвующий в обсуждениях на форуме."
            },
            {
            "term": "Фотожаба",
            "definition": "любительский фотомонтаж в графическом редакторе, созданный участниками какого-либо сообщества/форума специально под конкретное выложенное изображение."
            },
            {
            "term": "Фотошоп",
            "definition": "или «фотожоп», «фотожопа», от англ. «Photoshop» — 1) графический редактор Adobe Photoshop; 2) фотожаба, фейковое обработанное изображение/фото."
            },
            {
            "term": "Фреймворк",
            "definition": "от англ. «framework» — специальная платформа/ПО, главной задачей которой является облегчение создания, поддержки и объединения разнообразных компонентов проекта/приложения/сервиса и т.д."
            },
            {
            "term": "Фрек",
            "definition": "или «фрэк», «фидошн», от англ. «freq», «file request» — файловый запрос (способ, который позволяет одной фидонетовской системе во время сеанса связи с другой запросить у неё некоторые файлы)."
            },
            {
            "term": "Фривар",
            "definition": "от англ. «freeware» — ПО, находящееся в свободном доступе (бесплатное)."
            },
            {
            "term": "Фрикер",
            "definition": "от англ. «phreaker» — человек, промышляющий взломом ПК, компьютерных и телефонных сетей (использует для взлома не только технологии, но и человеческий фактор: выведывание, подглядывание, обман, шантаж и т.д.)."
            },
            {
            "term": "Фриланс",
            "definition": "от англ. «freelance» — оплачиваемая работа на дому (вне официального штата сотрудников). Часто фрилансер работает на себя и не имеет постоянных заказчиков и начальства."
            },
            {
            "term": "Фрилансер",
            "definition": "от англ. «freelancer» — человек, занимающийся фрилансом (работой на дому: на себя или компанию)."
            },
            {
            "term": "Фронтенд",
            "definition": "от англ. «front-end» — создание «внешней оболочки» веб-сайта/приложения (то, что видит пользователь)."
            },
            {
            "term": "Фронтендер",
            "definition": "от англ. «front-end» — it-специалист, разработчик фронтэнда (внешнего вида програмного продукта)."
            },
            {
            "term": "Фубар",
            "definition": "или «Foo и Bar» — наименования функций/переменных, по которым сложно судить об их назначении (допускается использование в учебной литературе, но запрещается в настоящих проектах)."
            },
            {
            "term": "Фуллстек-разработчик",
            "definition": "от англ. «full stack» — разработчик, который одновременно трудится в бэкенде и фронтэнде."
            },
            {
            "term": "Функция",
            "definition": "от англ. «function» — это ряд стейтментов для реализации некоторой задачи/задания."
            },
            {
            "term": "Фьюбар",
            "definition": "от англ. «Fucked Up Beyond Any Repair/Recognition» — слово общего назначения, дословно переводится с английского как «раздолбанное до неузнаваемости»."
            }
        ],
        "Х": [
            {
            "term": "Хаб",
            "definition": "от англ. «hub» — 1) узел какой-либо сети; 2) сетевой концентратор (распространяет трафик от одного подключённого устройства ко всем остальным); 3) крупный раздающий узел сети"
            },
            {
            "term": "Хабовка",
            "definition": "от англ. «hub» — разновидность сетёвки, где располагаются даунлинки одного хаба со своими пойнтами"
            },
            {
            "term": "Хак",
            "definition": "от англ. «hack» — 1) первоначально (появилось в университете Беркли) модификация кода программы, которая позволяет минимизировать размер программы, расширить функционал или ускорить работу, наконец, просто красивое программистское решение; 2) процесс взлома защиты чего-либо, обход какой-либо проблемы; 3) программа-модификатор"
            },
            {
            "term": "Хакатон",
            "definition": "от англ. «hack marathon» — мероприятие, где встречаются специалисты из разных отраслей разработки ПО (программисты, дизайнеры, тестеры и т.д.) для работы над общим проектом: приложением, программой"
            },
            {
            "term": "Хакать",
            "definition": "от англ. «hack» — 1) работать над чем-либо; 2) изучать что-либо; 3) видоизменять написанный код, делать его \"красивым\": устранять ненужные функции или добавлять новые"
            },
            {
            "term": "Хакер",
            "definition": "от англ. «hacker» — 1) увлеченный знаток компьютерной техники и ПО, являющийся экспертом в этой области (имеет лишь исследовательский интерес, без злого умысла); 2) синоним \"кракера\", кибер-преступника, т.е. человек, использующий свои технические знания во вред другим (взломать, заразить вирусом, добыть закрытую информацию и т.д.)"
            },
            {
            "term": "Хакинг",
            "definition": "от англ. «hack» — процесс преобразования некоторых элементов ПО для определённых целей, которые ему не свойственны"
            },
            {
            "term": "Хард",
            "definition": "или «винт», «харддиск», от англ. «hard disk» — накопитель, состоящий из жёстких магнитных дисков (НЖМД, жёсткий диск, винчестер); 2) аппаратное обеспечение компьютера, т.е. его комплектующие"
            },
            {
            "term": "Хардкодить",
            "definition": "от англ. «hardcore» — привычка статически прописывать в коде данные, которые по правилам должны вычисляться динамически. Практика считается плохой, антипаттерн в программировании"
            },
            {
            "term": "Хард скиллы",
            "definition": "от англ. «hard skills» — глубокие/значительные технические знания, умения и опыт"
            },
            {
            "term": "Хатчить",
            "definition": "от англ. «hatch» — загружать/\"закидывать\" какие-либо файлы в файлэху"
            },
            {
            "term": "Хатээмэль",
            "definition": "или «хатэмээль», «хэтемээль» — руссифицированное произношение HTML (HyperText Markup Language): язык гипертекстовой разметки, который используется для написания документов для веб-сайтов"
            },
            {
            "term": "Хидден",
            "definition": "от англ. «hidden» — 1) то, что существует, но сокрыто от посторонних взглядов (к примеру, некоторые элементы интерфейса); 2) в Фидонете: невидимая/скрытая служебная строчка в письме; 3) логический HTML-атрибут, который скрывает элементы, которым назначен"
            },
            {
            "term": "Хинт",
            "definition": "от англ. «hint» — 1) в общем смысле: совет/рекомендация/подсказка; 2) в графическом дизайне: элемент интерфейса, представляющий собой всплывающий текст-подсказку для обучения юзера"
            },
            {
            "term": "Хит",
            "definition": "от англ. «hit» — 1) просмотр одной странички сайта; 2) запрос к веб-серверу с целью получения необходимого файла (страницы, картинки, скрипта, таблицы и т. д.)"
            },
            {
            "term": "Холивар",
            "definition": "или «холивор», от англ. «holy war» — дословно \"святая война\", агрессивный спор между представителями противоположных мнений в интернете"
            },
            {
            "term": "Хомяк",
            "definition": "или «пага», от англ. «home page» — 1) стартовая (домашняя) интернет страница, открывающаяся при открытии браузера; 2) персональный сайт"
            },
            {
            "term": "Хост",
            "definition": "от англ. «hosting» — центральный сервер сети (любой компьютер), подключённый к локальной или глобальной сети"
            },
            {
            "term": "Хостер",
            "definition": "или «хостинг-провайдер», «веб-хостер», «HSP», от англ. «hosting» — компания, предоставляющая услуги хостинга (размещения на своей площадке сайтов/оборудования/данных)"
            },
            {
            "term": "Хостинг",
            "definition": "услуга, позволяющая разместить свой сайт на выделенном или виртуальном сервере"
            },
            {
            "term": "Хоститься",
            "definition": "от англ. «hosting» — пользоваться услугами хостингов"
            },
            {
            "term": "Хоткей",
            "definition": "от англ. «hotkey» — горячая клавиша (или сочетание клавиш для быстрого доступа к необходимым командам)"
            },
            {
            "term": "Хотфикс",
            "definition": "от англ. «hot fix» — исправление обнаруженных ошибок (багов), требующее немедленного решения/с горящими сроками"
            },
            {
            "term": "Хрюша",
            "definition": "1) транслитерация ОС Winsows XP (также: хря, хэрэ, хрень); 2) специалист HR (от «Human Resources»), занимающийся подбором/рекрутом кадров."
            },
            {
            "term": "Хэдер",
            "definition": "или «хедер», от англ. «header» — 1) элемент веб-страницы, расположенный в верхней его части и содержащий: логотип, меню, служебную информацию и т.д. 2) заголовочный файл библиотеки (.h)"
            },
            {
            "term": "ХэПэ",
            "definition": "или «хьюлет пакарт») — русифицированная аббревиатура компании Hewlett Packard"
            }
        ],
        "Ц": [
            {
            "term": "Целочисленный тип данных",
            "definition": "тип, при котором переменные способны содержать исключительно целые числа (без дробной части)"
            },
            {
            "term": "Цикл",
            "definition": "в программировании: некая языковая конструкция, заставляющая программу неоднократно исполнять определенные инструкции до тех пор, пока заданное условие не станет ложным/истинным"
            },
            {
            "term": "ЦМ",
            "definition": "круглосуточный; происходит от того, что в строке нодлиста для круглосуточно работающего узла ставится флаг CM (от Continuous Mail — беспрерывная передача почты)"
            },
            {
            "term": "ЦОД",
            "definition": "место расположения (хостинга) серверов/ИТ-инфраструктуры с целью обеспечения их бесперебойного функционирования"
            },
            {
            "term": "ЦП",
            "definition": "компьютерный компонент, обрабатывающий машинный код. Отвечает за интерпретацию и выполнение большинства команд от другого аппаратного и программного обеспечения компьютера"
            },
            {
            "term": "Цэмээс",
            "definition": "система управления контентом, которая используется для обеспечения и организации совместной работы над его созданием, редактированием и управлением"
            },
            {
            "term": "Цээсэс",
            "definition": "формальный язык, в котором содержится набор определенных свойств для описания внешнего вида любых HTML документов"
            }
        ],
        "Ч": [
            {
            "term": "ЧаВо",
            "definition": "сокр. от «ЧАсто задаваемые ВОпросы». Блок ответов на часто задаваемые вопросы."
            },
            {
            "term": "Чайник",
            "definition": "новичок, неопытный начинающий пользователь, который пока плохо разбирается в чем-либо"
            },
            {
            "term": "Чат",
            "definition": "способ общения пользователей сети в режиме реального времени, по средствам обмена текстовыми сообщениями"
            },
            {
            "term": "Чекать",
            "definition": "что-то проверять, просматривать на предмет необходимой информации или для поиска ошибок"
            },
            {
            "term": "Чекбокс",
            "definition": "элемент графического интерфейса, который дает пользователю возможность управлять параметром с двумя состояниями"
            },
            {
            "term": "Чекиниться",
            "definition": "поставить отметку, подтверждающую ваше присутствие в каком-то определенном месте/мероприятии"
            },
            {
            "term": "Челлендж",
            "definition": "1) необычная нестандартная проблема/задача, решение которой можно считать своим достижением; 2) в социальных сетях: некая последовательность действий/слов, которую повторяет большое количество пользователей"
            },
            {
            "term": "Червь",
            "definition": "вирус (вредоносное ПО), проникающий в компьютер через локальную/глобальную компьютерную сеть"
            },
            {
            "term": "Черрипик",
            "definition": "Команда git cherry-pick применяется для перенесения некоторых коммитов из одного места репозитория в другое"
            },
            {
            "term": "Читерство",
            "definition": "в компьютерных играх: процесс приобретения обманным путем каких-либо привилегий путем использования чит-кодов и специального ПО"
            },
            {
            "term": "Чит-код",
            "definition": "в сфере компьютерных игр: определенных набор символов, который вводится в командную строку для получения каких-либо ресурсов/преимуществ/привилегий"
            },
            {
            "term": "Читкодер",
            "definition": "в сфере компьютерных игр: игрок, применяющий специальные чит-коды, которые дают определенные привилегии и бонусы"
            },
            {
            "term": "ЧПУ",
            "definition": "расшифровывается как 'человекопонятный url'. Это адрес страницы, отображаемый в адресной строке, состоящий из понятных для пользователя символов, коротко отражающих содержание активной страницы"
            },
            {
            "term": "ЧСВ",
            "definition": "сокращение от 'Чувство Собственной Важности'. Людей с завышенной самооценкой часто называют чсвэшниками"
            }
        ],
        "Ш": [
            {
            "term": "Шаблон",
            "definition": "дает возможность создать единую версию функции/класса, работающую с различными типами данных"
            },
            {
            "term": "Шаблоны функций",
            "definition": "в языке С++: функции, использующиеся как образец/шаблон при создании похожих функций без уточнения типа(ов) некоторых или всех переменных)"
            },
            {
            "term": "ШАР",
            "definition": "протокол беспроводного доступа /передачи данных WAP, созданный для сетей GSM. Он позволяет установить связь мобильного устройства с сетью Интернет"
            },
            {
            "term": "Шара",
            "definition": "открытые для общего доступа файлы, папки, диски и т. п."
            },
            {
            "term": "Шарить",
            "definition": "1) хорошо понимать, отлично разбираться в чём-либо; 2) 'шерить', т.е. давать другим доступ к чему-то, обычно к определенным папкам, файлам, хранилищам"
            },
            {
            "term": "Шаровары",
            "definition": "коммерческое ПО, которое является условно-бесплатным, т.е. его свободное распространение не подразумевает его принадлежность к свободному ПО"
            },
            {
            "term": "Шарпы",
            "definition": "современный объектно-ориентированный язык программирования C# (в противовес языку C++ – «плюсам»)"
            },
            {
            "term": "Шильдик",
            "definition": "наклейка/табличка, содержащая информацию о маркируемом изделии: модель/основные технические характеристики и т.д."
            },
            {
            "term": "Ширина пула",
            "definition": "число модемов в модемном пуле (зачастую, у интернет-провайдера)"
            },
            {
            "term": "Шланг",
            "definition": "сетевой кабель для интернет-соединения и передачи данных"
            },
            {
            "term": "Шредер",
            "definition": "1) агрегат для утилизации использованной офисной бумаги; 2) ПО, предназначенное для полного удаления файлов с компьютера"
            }
        ],
        "Э": [
            {
            "term": "Эксель",
            "definition": "табличный процессор Microsoft Excel - популярная программа для работы с электронными таблицами"
            },
            {
            "term": "Экскоммуникация",
            "definition": "отключение системы от фидо, т.е. отказ узлов сети в установлении связи с экскоммуницируемым узлом сети"
            },
            {
            "term": "Эксплойт",
            "definition": "фрагмент кода или вредоносная программа кода, которая способна выполнять атаки на вычислительную систему через найденную уязвимость"
            },
            {
            "term": "Электронная почта",
            "definition": "технология и служба по отправке и получению сообщений в электронном формате между пользователями компьютерной сети"
            },
            {
            "term": "Эникей",
            "definition": "любая клавиша на клавиатуре, часто встречается в уведомлениях типа 'Press any key'"
            },
            {
            "term": "Эникейщик",
            "definition": "работник IT-сферы с низкой квалификацией, занимающийся шаблонными, простыми задачами"
            },
            {
            "term": "Эпикфэйл",
            "definition": "дословно переводится как 'эпический провал'. Фиаско, крах, серьезная неудача"
            },
            {
            "term": "Эфайщик",
            "definition": "эксперт по модулю SAP FI , автоматизирующий процессы бухгалтерского и финансового учета"
            },
            {
            "term": "Эффект боке",
            "definition": "намеренное мягкое размытие заднего (или переднего) плана в процессе фото-съемки для выделения главного объекта"
            },
            {
            "term": "Эха",
            "definition": "в Фидонете: форма общения, аналогичная новостным группам, место публикации сообщений по определённой тематике"
            },
            {
            "term": "Эхотаг",
            "definition": "строка со служебным названием эхоконференции (эхи)"
            }
        ],
        "Ю": [
            {
            "term": "Юзабилити",
            "definition": "показатель удобства работы пользователя с тем или иным продуктом или объектом"
            },
            {
            "term": "Юзать",
            "definition": "использовать/применять/пользоваться (например: 'дай мне поюзать твой самокат')"
            },
            {
            "term": "Юзверь",
            "definition": "то же, что 'юзер', только еще более активный"
            },
            {
            "term": "Юзер",
            "definition": "активный пользователь компьютера или Сети, идет сразу после 'чайника'"
            },
            {
            "term": "Юзерпик",
            "definition": "графическое обозначение пользователя в Интернете (картинка/фото/изображение)"
            },
            {
            "term": "Юзнуть",
            "definition": "немного попользоваться каким-то устройством, попробовать разобраться с незнакомым функционалом"
            },
            {
            "term": "Юникс",
            "definition": "семейство гибких, многозадачных и многопользовательских ОС, характеризующихся модульным дизайном"
            }
        ],
        "Я": [
            {
            "term": "Яблочник",
            "definition": "активный пользователь устройств бренда Apple или ярый фанат компании Apple"
            },
            {
            "term": "Яндекс",
            "definition": "поисковая система и интернет-портал от российской транснациональной компании"
            },
            {
            "term": "ЯП",
            "definition": "язык программирования - формальный язык, предназначенный для записи компьютерных программ"
            },
            {
            "term": "Ярлык",
            "definition": "разновидность значка, указывающего на объект. У объекта может быть бесконечно много ярлыков."
            }
            ]
        }
}

